[
{"title": "PowerWashing Professional", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-26T21:13:12-0400", "url": "https://rochester.craigslist.org/lab/d/webster-powerwashing-professional/7845574501.html", "description": "Hello, We are hiring another member on the Space Clean Exterior Cleaning team this Spring! We are a locally owned professional PowerWashing company based out of Rochester, New York. You must be -Responsible, Reliable and Respectful -Comfortable on second story roof level heights -Presentable in a professional manner -Capable of following directions -Physically fit enough to handle the work tasks The pay starts at $20 per hour PLEASE send us an email with your resume or brief description about yourself. Please leave your phone number and we will call you. Thank You!", "attributes": {}},
{"title": "dishwasher", "compensation": null, "employment_type": null, "location": "703 Park Ave", "posted_date": "2025-04-23T21:16:09-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-dishwasher/7844752907.html", "description": "Leonore's is located at 703 Park Ave in Rochester, NY. We're looking for a full time or part time dishwasher. Hours are 4:00- 11/11:30 Wednesday- Sunday. Experience is preferred but not necessary. Opportunities for growth available! Please attach a resume if available.", "attributes": {}},
{"title": "LAWN CARE APPLICATOR", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-24T07:44:56-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-lawn-care-applicator/7844804060.html", "description": "CLOVER LAWN AND LANDSCAPE IS LOOKING FOR A LAWN CARE APPLICATOR . EXPERIENCE IS NEEDED ,  PLEASE CALL 585-244-1626 X 104  TOP PAY , BENEFITS , 401K 50 YEAR OLD COMPANY", "attributes": {}},
{"title": "DELIVERY DRIVER", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-24T08:01:03-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-delivery-driver/7844806041.html", "description": "CLOVER NURSERY AND GARDEN CENTER IS LOOKING FOR DELIVERY DRIVER . FOR MULCH , TOPSOIL , STONE . PRIMARILY EAST SIDE . NO SPECIAL LICENSE REQUIRED CALL 585-482-5372", "attributes": {}},
{"title": "Medical Assistant", "compensation": null, "employment_type": null, "location": "497 Beahan Road", "posted_date": "2025-04-24T08:38:14-0400", "url": "https://rochester.craigslist.org/hea/d/rochester-medical-assistant/7844811461.html", "description": "Very busy pediatric medical practice on the Westside, seeking a full time experienced medical assistant.  The office accommodates patients 6 days a week, winter hours with some nights till 6PM (limited hours on the weekend, typically 8-12). Approximately 32-40 hours per week. Qualified candidate must have great communication skills, be compassionate, ability to be flexible and multi-task. Competitive wages and benefits including 401k. Please send resume.", "attributes": {}},
{"title": "Lilac Festival Short Order Cooks & Cashiers!!", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-24T08:55:54-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-lilac-festival-short-order/7844814535.html", "description": "Looking for short order cooks and cashiers to work in our concessions tents and food trucks at the Rochester Lilac Festival downtown in Highland Park May 9-May 18!! Every day service is 10am-8:30pm. We would be looking for highly motivated people who want to work in a fun environment serving at festivals.", "attributes": {}},
{"title": "Carpenter/Handyman", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-24T08:56:30-0400", "url": "https://rochester.craigslist.org/trd/d/clifton-springs-carpenter-handyman/7844814639.html", "description": "We are hiring a skilled carpenter for a full-time modular home construction contractor in Clifton Springs. Pay between $22-$28/hour, along with weekly pay. Hours are 7:00AM-3:30PM Monday through Friday. Must have reliable transportation. If interested, please reach out to Ben at (518) 218-5868 or boconnell@aerotek.com. Interviews will be conducted this week/early next week and can start the next day.", "attributes": {}},
{"title": "CONCRETE MASONS/FINISHERS POSITIONS", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-24T10:04:02-0400", "url": "https://rochester.craigslist.org/trd/d/avon-concrete-masons-finishers-positions/7844831474.html", "description": "Specific Masonry Positions Available: Carpenters, Masons, Finishers, Laborers, Form Fitters LG Evans Construction, Inc. performs work on a mix of public prevailing rate and private commercial projects in the site and concrete construction Market. Applicants with a versatile resume are encouraged to apply. Reliability, a strong work ethic, and professionalism are a MUST. Work will be primarily in the Rochester and surrounding counties area with some minor travel required. The pay range is approximately $20-$30/hr based on position and experience and is negotiable. We also offer medical benefits, PTO, and a 401K plan with company match, along with an excellent working environment!! Apply today! There are a variety of ways: Website: www.lgevansinc.com - submit an application right from the career tab In person: Our main headquarters is located at 1823 Lakeville Road, Avon, NY, 14414 Have questions? Call (585) 226-2240", "attributes": {}},
{"title": "Electrical Estimator Project Manager", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-24T10:04:04-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-electrical-estimator-project/7844831488.html", "description": "We are looking for an Electrical Estimator -with at least 5 years electrical experience in the electrical field. We will train the right person. Must be able to read blue prints, have computer skills , be able to walk properties, deal with customers, create proposals for new and existing electrical and lighting systems and have great people skills. This is a full time position with great pay and benefits. This is the perfect position for an Electrician that doesn't want to work in the field", "attributes": {}},
{"title": "Electrical Estimator Assistant", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-24T10:04:51-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-electrical-estimator-assistant/7844831765.html", "description": "We are looking for an Electrical Estimator -with at least 5 years electrical experience in the electrical field. We will train the right person. Must be able to read blue prints, have computer skills , be able to walk properties, deal with customers, create proposals for new and existing electrical and lighting systems and have great people skills. This is a full time position with great pay and benefits. This is the perfect position for an Electrician that doesn't want to work in the field", "attributes": {}},
{"title": "Construction Laborer", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-24T10:05:13-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-construction-laborer/7844831886.html", "description": "We are looking for a Construction Laborer that has experience with site work. This person needs to be a self starter that can multi task and has construction experience. ***Drivers License is a must **** We offer top pay and benefits !", "attributes": {}},
{"title": "Hiring dishwashers", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-24T10:39:00-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-hiring-dishwashers/7844841441.html", "description": "Hiring full time and part time dishwashers, fulltime tues-sat 2:30-close, part time Fri and Sat 2:30-close. Duties include washing dishes, cleaning, light prep, and assisting line cooks. Applicants please respond with full name, availability, experience and or resume, and a little bit about yourself and why you would be a good fit. Please do not show up in person or call the restaurant or you will not be considered for the position.", "attributes": {}},
{"title": "Best starting opportunity (start today)", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-24T11:35:31-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-best-starting-opportunity/7844859817.html", "description": "General labor (start tomorrow) text me 585-500-5662 Construction and installation of our great products   (must have transportation) previous construction experience a plus Looking for a hard working person , who wants to learn a trade with the opportunity to advance, previous experience in work is ideal and or general construction. Can read a tape measure and use hand tools. About us: long time established company, regular hours generally 8:00-4:30. Pay based on experience, Checks issued weekly Call and tell us what experience you have. (Please leave best contact number and time to call, so we don't have to play phone tag) tell me why i should hire you??? Thank you! Looking for team player, who wants great work with good people, Ground floor opportunity, year-round work. Previous installation experience helpful. Must be hard working, organized, and detail oriented. Must have own transportation. Please.  Text me your information and best time to call you and Start right away (training available for the right person(s) text me today  585-500-5662 with your name and best time to call ! text mt start right away!", "attributes": {}},
{"title": "FIORELLA IS HIRING A HOST", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-24T11:49:53-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-fiorella-is-hiring-host/7844864667.html", "description": "We are looking for a friendly, upbeat host to work Wednesday through Saturday evening shifts. Must be available to work all four days. The ideal candidate would have a welcoming personality, is neat and very organized, is able to answer phones and schedule reservations, and is a team player. They should be willing to fill in a variety of tasks as needed keep up with busy shifts. If you love the restaurant business and genuinely enjoy people, we need to hear from you. Please respond to this post with your resume and availability for an interview", "attributes": {}},
{"title": "Experienced cook -three nights per week!", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-24T11:59:52-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-experienced-cook-three-nights/7844868011.html", "description": "Cook with short order experience for family style restaurant. Looking to hire for three nights only- thursday, friday and Saturday nights. Great people to work with. Closing is at 9:00pm. Please call Elizabeth 585-354-4941.", "attributes": {}},
{"title": "Seamless Gutter installer", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-24T13:15:29-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-seamless-gutter-installer/7844898361.html", "description": "Gutter installer. Driver's license required good work ethic top pay shining bonus after one month call David Thibodeau gutter company 585-317-3116 must be good with ladder work and hand tools will train", "attributes": {}},
{"title": "HOST OR HOSTESS", "compensation": null, "employment_type": null, "location": "202 North washington Street near East Walnut Street", "posted_date": "2025-04-09T17:38:52-0400", "url": "https://rochester.craigslist.org/fbh/d/east-rochester-host-or-hostess/7841186895.html", "description": "Perlo's Restaurant, located in East Rochester, New York seeks to fill the position of host or hostess. This full or part time position is available to a self-motivated, professional and reliable candidate with a minimum of three years of fine dining host or hostess experience who has the ability to perform and excel in a very busy restaurant environment. Visit www.perlos.us to view more detailed information relating to Perlo's Restaurant. Email resume or apply in person at 202 North Washington Street, East Rochester, New York 14445, CALL OR TEXT 585-733-0606. Pay rate for a qualified candidate is $20.00 per hour but shall be commensurate with experience. Equal Opportunity Employer.", "attributes": {}},
{"title": "Daytime Line Cook (PT & FT)", "compensation": null, "employment_type": null, "location": "176  S Goodman St near Park Ave", "posted_date": "2025-04-09T21:39:36-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-daytime-line-cook-pt-ft/7841237488.html", "description": "Want to be out of work by 3:30pm? Join our team @Mad Hatter! We are open Tuesday-Sunday 8am-2:30pm. Seeking seasoned line cooks. Must have a minimum of 3 years experience working in a commercial kitchen. Fast paced environment. Competitive pay based on skillset and experience.    Internship options available. Seasonal, par time or full time available. Apply in person or online at www.madhatterrochester.com", "attributes": {}},
{"title": "Esthetician /Nail Technician", "compensation": null, "employment_type": null, "location": "28 Willow Pond Way", "posted_date": "2025-04-09T23:09:32-0400", "url": "https://rochester.craigslist.org/spa/d/penfield-esthetician-nail-technician/7841248978.html", "description": "We’re Hiring at Loving You Nails & Spa! Position: Licensed Esthetician/Nail Technician Status: Full-Time or Part-time Position Available Start Time: Immediate Opening Loving You Nails & Spa, a holistic day spa located in Penfield, NY, is looking for a talented and passionate Esthetician or Nail Technician with one year of experience to join our team! We specialize in organic and advanced skincare, and holistic non-toxic pedicures and manicures What We Offer: •\tA serene, supportive spa environment •\tEstablished client base •\tCompetitive commission-based pay/rental or hourly •\tOpportunities for growth and continued education •\tProducts and supplies provided •\tBeautiful, newly renovated space with luxury touches Ideal Candidate: •\tLicensed in New York State •\tProfessional, reliable, and passionate about holistic beauty •\tExperienced in natural nail care (Dazzle Dry experience is a plus!) •\tCommitted to excellent client care and sanitation practices •\tTeam player with a positive attitude If you’re ready to be part of a growing spa that values wellness, relaxation, and self-care, we’d love to hear from you! To Apply: Please email your resume and availability to www.lovingyounailspa.com Contact Mary or call/text 585-280-3533. Location: Loving You Nails & Spa 28 Willow Pond Way, Suite 100 Penfield, NY 14526 Join us in creating a relaxing, beautiful experience for every client—one appointment at a time.", "attributes": {}},
{"title": "Line cook", "compensation": null, "employment_type": null, "location": "407 commerce dr near Victor Pittsford rd", "posted_date": "2025-04-10T07:26:19-0400", "url": "https://rochester.craigslist.org/fbh/d/victor-line-cook/7841281078.html", "description": "Looking for an EXPERIENCED line cook that can work in a very fast paced diner. NO NIGHTS Weekends are a must. Pay will be based on experience. Please come in person between the hours of 7-11am to apply. No phone calls please The original Steve’s diner Victor 407 commerce dr. Victor 14564", "attributes": {}},
{"title": "HVAC installer", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-10T09:03:45-0400", "url": "https://rochester.craigslist.org/trd/d/spencerport-hvac-installer/7841295092.html", "description": "HVAC Installer. Experienced or will train. Learn a great trade. Need own transportation to job. Will provide tools if needed. Installing Heat Pumps, ductwork, furnaces, insulation. Instalador de HVAC. Con experiencia o entrenara. Aprende un gran oficio. Necesito mi propio transporte al trabajo. Proporcionara herramientas si es necesario. Instalacion de bombas de calor, conductos, hornos, aislamiento.", "attributes": {}},
{"title": "AUTOMOTIVE TIRE TECHNICIANS ($800 New Hire Bonus)", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-10T09:47:19-0400", "url": "https://rochester.craigslist.org/lab/d/mount-morris-automotive-tire/7841304556.html", "description": "", "attributes": {}},
{"title": "Line Cook/Saute Cook", "compensation": null, "employment_type": null, "location": "4699 Lake Avenue", "posted_date": "2025-04-10T10:13:39-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-line-cook-saute-cook/7841311601.html", "description": "Company Description: Mr. Dominic's is an Italian Restaurant located In Rochester, NY in Charlotte on Lake Aveune. Family Owner and Operated since 1976. Role Description: This is a full-time or part-time,  on-site role for a Line Cook at Mr. Dominics at the Lake located in Rochester, NY. The Line Cook will be responsible for preparing ingredients, cooking menu items, and ensuring the quality.", "attributes": {}},
{"title": "Part Time & Full Time Solo Class A CDL Night Positions", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-10T10:15:13-0400", "url": "https://rochester.craigslist.org/trp/d/west-henrietta-part-time-full-time-solo/7841312048.html", "description": "", "attributes": {}},
{"title": "FIORELLA HIRING EVENING HOST", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-10T10:45:50-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-fiorella-hiring-evening-host/7841319942.html", "description": "We are looking for a friendly, upbeat host to work Wednesday through Saturday evening shifts. Must be available to work all four days. The ideal candidate would have a welcoming personality, is neat and very organized, is able to answer phones and schedule reservations, and is a team player. They should be willing to fill in a variety of tasks as needed keep up with busy shifts. If you love the restaurant business and genuinely enjoy people, we need to hear from you. Please respond to this ad with your resume and interview availability", "attributes": {}},
{"title": "Screen Printer/Folders/Reclaim positions", "compensation": null, "employment_type": null, "location": "1916 LYELL AVE near Lee Rd", "posted_date": "2025-04-10T13:23:36-0400", "url": "https://rochester.craigslist.org/mnu/d/rochester-screen-printer-folders/7841373590.html", "description": "TM Design Corp on Lyell Avenue in Gates is looking to fill positions in our Screen Printing Department. Printing, Folding and screen reclaim are available. *Union Job with Benefits* -Apply in person to the address below, and/or email a resume, DO NOT CALL. -Full Time position -OT available some of the time. -Hours: 8am - 4pm; or 8:30am - 4:30pm -After 60 days, ACA approved health care with a 50% copay on premium. -Union Position (after 6-month probationary period) PPPWU Local 503. -After 6-months benefits include 6 paid holidays, union pension (501c) and a 401k w/match. -After 1-year, benefits include 2-weeks PTO (1 wk Vaca/1 wk Sick) (unused PTO is paid out each year) -Must be reliable, able to work 40 hours, must demonstrate good attendance. -Must be a highly motivated person! -Must be able to work on feet and in heat, and lift boxes weighing up to 35lbs. -Must work well with others, and stay focused. -Other positions maybe available now or soon. If you are self-motivated and looking to work for a small company, and grow with a company which has 33 years in the t-shirt printing industry and 28 years as a union ship, come fill out an application. TM Design of Rochester, Corp 1916 Lyell Ave Rochester, NY 14606 Hours 9am - 5pm Right by the canal in Gates, across from Gerber collision, near the , just off 390 @ Lyell. Get off 390 at Lyell, head towards the city, on north side of road by canal just before you cross into the city.", "attributes": {}},
{"title": "Short order cooks/fryers", "compensation": null, "employment_type": null, "location": "3670 lake rd near 104 and 19", "posted_date": "2025-04-10T13:33:30-0400", "url": "https://rochester.craigslist.org/fbh/d/clarkson-short-order-cooks-fryers/7841377088.html", "description": "Full-time/part time", "attributes": {}},
{"title": "Door Installer", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-10T13:55:38-0400", "url": "https://rochester.craigslist.org/trd/d/batavia-door-installer/7841384973.html", "description": "Door Installer’s Needed (Exterior, Patio, Interior, Barn, Storm, And Security Doors) RFI facilitates over 400,000 installations annually across the country. With a network of over 1,500 independent contractors, we provide installation services for over 20 different home improvement products including doors, windows, siding, kitchen, bath, closets, and more. Looking to expand your existing business OR get a foot in the door as a start-up? ✓ RFI offers unlimited opportunities and growth potential. Looking to supplement your current revenue? ✓ RFI provides you with additional revenue while you continue running your existing business ✓ RFI offers supplemental income for experienced contractors looking to perform Storm/Security door measures and installations as well!  This is a great way to supplement your income while working alone! Tired of chasing your money? ✓ RFI offers consistent pay. We direct deposit every two weeks upon completion of work. Tired of investing in marketing and advertising? ✓ With RFI there is no marketing necessary. We are partnered with national retailers who invest millions in marketing and advertising. Leads are provided to you free of charge. Are you wasting time performing FREE in-home estimates that do not convert to actual work? ✓ No cold calls, no canvasing, no sales! Our customers come to our retailers because they are ready to buy. You get the measurements; they close the sale. We pay for measurements! Requirements •\tMust be able to pass a detailed background investigation. •\tMinimum of 5 years' experience installing doors and/or trim carpentry is preferred. •\tVehicle, trailer, or some way to transport products to job sites. •\tMust provide own tools- IE: trim carpentry/door installation tools. •\tAccess to a smart phone and/or tablet, as well as a computer with an internet connection. •\tEPA or State RRP Certified (Lead Safe Work Practices). We can assist in obtaining certification if necessary. •\tLicensed and Insured (according to local/state requirements)", "attributes": {}},
{"title": "AUTO BODY AND PAINT.", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-10T14:03:00-0400", "url": "https://rochester.craigslist.org/lab/d/victor-auto-body-and-paint/7841387639.html", "description": "LOOKING FOR AUTO BODY AND PAINT PERSON, MALE OR FEMALE NOT IMPORTANT. PART TIME OR FULL TIME. L0CATED IN VICTOR. BUSY SHOP, VACATION AND PTO. PLEASE SEND RESUME.", "attributes": {}},
{"title": "Pintxo Wine Bar seeks Server!", "compensation": null, "employment_type": null, "location": "27 Coach St", "posted_date": "2025-04-10T14:57:41-0400", "url": "https://rochester.craigslist.org/fbh/d/canandaigua-pintxo-wine-bar-seeks-server/7841404996.html", "description": "Canandaigua's Spanish wine bar and restaurant, Pintxo, is looking for a P/T server. This position is 3p-close Wed-Fri. We close at 9p (10p Fri/Sat). We are a small and tight-knit team, we take pride in the details of our work in a kind and organized environment, and we all support one another in getting the job done. We're 11 months in, and while carrying out our mission of providing elegant and comfortable service, our focus is on getting better every day. Some wine knowledge is preferred, and we'll train on our list and Spain in general. Passionate learners to the front of the line!", "attributes": {}},
{"title": "AUTO TECH NEEDED", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-10T16:00:25-0400", "url": "https://rochester.craigslist.org/lab/d/victor-auto-tech-needed/7841424148.html", "description": "AUTO TECH NEEDED, 40 HOURS PER WEEK, NO WEEKENDS, LOCATED IN VICTOR NY, MUST HAVE TOOLS AND EXPERIENCE IN AUTO REPAIR. PLEASE SEND RESUME.", "attributes": {}},
{"title": "Diesel / Automotive Technician", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-10T16:08:24-0400", "url": "https://rochester.craigslist.org/trp/d/gainesville-diesel-automotive-technician/7841426673.html", "description": "We are growing and adding additional Diesel and Automotive Technicians to our Family-Owned Business. We have a New State of the Art Repair Facility located in Gainesville, N.Y., being one of the largest growing diversified repair facilities in the region. Our customer base ranges from Medium and Heavy-Duty Trucks to Trailers along with Agriculture Equipment. We off competitive Wages, Benefits, Uniforms, House Training Programs, Locker Rooms and a Kitchenette. Technicians must have a least 1 year of Base Knowledge, Experience and Tools. CDL License and a NYS DOT Inspectors License are a plus to your application. Wages are based on Experience and individuals drive to succeed. Stop by and get a Tour our Facility to get a full understanding on exactly what we have to offer you in your career development and advancement and consider joining out Team. Benefits: 401(k) 401(k) matching Dental insurance Employee assistance program Employee discount Health insurance Health savings account Life insurance Paid time off Referral program Retirement plan Tuition reimbursement Vision insurance", "attributes": {}},
{"title": "Seasonal Lifeguard Needed! Great Pay!", "compensation": null, "employment_type": null, "location": "1600 Elmwood Ave.", "posted_date": "2025-04-10T16:20:40-0400", "url": "https://rochester.craigslist.org/etc/d/rochester-seasonal-lifeguard-needed/7841430558.html", "description": "Seasonal Lifeguards Needed: Must have own transportation, a valid driver's license and be at least 18 years of age. Must be NYS certified and American Red Cross CPR for Professional Rescuer. Must be able to work from Memorial Day to Labor Day. ($Bonus if qualified). Pool hours 11 am to 8 pm must be available for either shift and any day or weekend. Contact Missy @ 585-473-2544 or apply at 1600 Elmwood Apartments, 1600 Elmwood Ave, Brighton, NY 14620 Monday-Friday 9 am to 5 pm. We look forward to hearing from you!", "attributes": {}},
{"title": "Line Cooks", "compensation": null, "employment_type": null, "location": "east river rd near jefferson rd", "posted_date": "2025-04-10T16:56:35-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-line-cooks/7841441794.html", "description": "MicGinny's is now hiring line cooks. Must have night and weekend availability as well as reliable transportation. Minimum 3 years experience required. We are looking to add responsible, self-motivated individuals who can work well alone as well as in a team setting.", "attributes": {}},
{"title": "Lawn Mowing Crew/Landscape position available", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-11T07:51:41-0400", "url": "https://rochester.craigslist.org/lab/d/webster-lawn-mowing-crew-landscape/7841551359.html", "description": "Established Lawn and Landscape company looking to hire someone with several years experience out in the lawn and landscape field. Must have several years of experience working with lawn mowing crew, trimming shrubs, edging beds, weeding, mulching, spring/fall clean-ups etc..... (some training is available). Snowplowing is available in the winter months Must be reliable and dependable with a valid drivers license. Must have a good eye for detailed work. Pay is based on experience and is negotiable. (good pay for the right person with experience with Performance bonuses) For more info please call (585)214-9898 if no answer leave a voice mail or text is ok. (pls no emails) ty", "attributes": {}},
{"title": "Truck Driver/Car hauler", "compensation": null, "employment_type": null, "location": "250 Lein Rd", "posted_date": "2025-04-11T08:25:09-0400", "url": "https://rochester.craigslist.org/trp/d/buffalo-truck-driver-car-hauler/7841555235.html", "description": "Truck Drivers.  Start the New Year in a BIG way! Are you in the car-hauling, motor freight, long haul or LTL job where your talent is not appreciated?  \"Get the work out\" is the mantra? Would you like to come to a place every day where you are surrounded by car-haulers whose skills are celebrated?  At OnLine Auto Connection we believe our purpose is to build a better company full of Professional Car Haulers, setting an example for the trucking industry.  At OnLine Auto Connection we work hard, we play hard and change lives. If you are a Truck driver with some experience (2Yr.), who wants to learn to haul cars, we offer training! OnLine Auto Connection will train you to ear a 6 figure income!  Call today, Auto Transport School begins! Regional Positions available based out of Buffalo, NY. What we Offer: -Paid Training and support for non-experienced car haulers. -Home on weekends. (WNY region) -Paid Weekly. -Earn 6 figures a year. $$ -Full Company Paid Medical/Dental/Vision. -401k with Company contribution. -Life Insurance/Disability. -Newest Fleet of trucks in WNY. -Bonuses for Productivity and Longevity. What you Bring: -Valid Class A CDL with acceptable MVR record. -Ability to enter Canada. -Minimum 23 years of age with 2 years OTR experience. -Strong work ethic, neat appearance and willingness to learn. *Please include an email or phone contact if you reply thru this add so I can actually respond!*", "attributes": {}},
{"title": "Office Furniture Installers Needed", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-11T09:31:34-0400", "url": "https://rochester.craigslist.org/trd/d/office-furniture-installers-needed/7841567466.html", "description": "Full time/Part Time jobs available. Well known company in its field, looking for qualified office furniture installers for large corporate clients. Must have tools and a good drivers license. Must be mechanically inclined. Pay and benefits based on experience. Please do not apply if you do not have prior experience in assembly. Please attach your resume.", "attributes": {}},
{"title": "HORSE FARM ASSISTANT", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-11T10:14:18-0400", "url": "https://rochester.craigslist.org/lab/d/honeoye-falls-horse-farm-assistant/7841577640.html", "description": "Help with daily care Groom Turnout Stalls Bring in Quality horses and staff Hard work Happy barn", "attributes": {}},
{"title": "Modern Salon - Openings for Chair Rent & Chair Rental", "compensation": null, "employment_type": null, "location": "246 Spencerport Road near Long Pond", "posted_date": "2025-04-11T10:17:09-0400", "url": "https://rochester.craigslist.org/spa/d/rochester-modern-salon-openings-for/7841578387.html", "description": "Rare Opportunity for Nail Tech and Chair Rental in Modern Upscale Salon We now have openings for: Nail Tech -  Modern Station in Upscale Salon Chair Rental - Modern Station in a Upscale Salon Please give us a call to find out more information and set up a time to come in at 585-413-39one9", "attributes": {}},
{"title": "Maintenance Tech", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-11T10:48:05-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-maintenance-tech/7841586488.html", "description": "Looking for Maintenance Tech with strong background in Framing, Drywall Install and Finish and Painting.  Plumbing, Electrical and Vinyl Plank Flooring.", "attributes": {}},
{"title": "OTR CDL Driver wanted", "compensation": null, "employment_type": null, "location": "525 Attridge Road", "posted_date": "2025-04-11T10:58:58-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-otr-cdl-driver-wanted/7841589328.html", "description": "Solid Carriers is an OTR company looking for motivated drivers with at least 2 years of experience, clean driving record, and no issues with drugs or alcohol, for cross county reefer loads. 1099 pay starting at .57cpm with pay increase after 90 days, extra stop pay and monthly fuel bonus Trucks are clean, with refrigerator and new bedding. No NYC, and rarely go east/north of Albany. Drivers are expected to run legally, be courteous to brokers and fellow drivers. (Yes, even those pesky 4 wheelers!!) and have an all around good attitude. We understand that may be tough at times, and drivers rarely get the appreciation they deserve, but we try to hold ourselves to a higher standard from driver all the way up to the owner. Solid Carriers offers a drop yard to leave the truck when you come home that is fenced in to keep your vehicle safe when you are on the road. If this sounds like something you are interested in, please contact us via email. we currently have one open truck, Hope to hear from some good drivers soon. Stay safe out there drivers, hope to hear from you soon.", "attributes": {}},
{"title": "Delivery and Setup Team Member", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-11T11:28:11-0400", "url": "https://rochester.craigslist.org/lab/d/bergen-delivery-and-setup-team-member/7841598154.html", "description": "Job Description: Join our hardworking team at an established event and tent rental company! We’re looking for a dedicated Delivery and Setup Team Member to assist with the delivery, setup, and dismantling of event equipment and tents. This is a physically demanding, hands-on role that requires a strong work ethic and the ability to work long hours. You’ll play an essential role in ensuring that events run smoothly by installing tents, setting up chairs, tables, lighting, and other event equipment, as well as striking and packing equipment after events. Key Responsibilities: •\tDelivering and installing tents and event equipment (Chairs, Tables, Lighting, etc.) at various event locations •\tDismantling and striking equipment post-event and ensuring items are packed correctly for transport •\tEnsuring all equipment is set up according to client specifications and safety standards •\tLoading and unloading trucks, handling equipment with care •\tMaintaining a clean and organized work environment during events •\tPerforming general manual labor as needed to assist the team in achieving event setup goals •\tEnsuring timely deliveries and pickups of rental equipment •\tCommunicating effectively with team members and clients Requirements: •\tClean driving record with valid driver’s license (CDL preferred but not required) •\tAbility to work long hours and weekends as required •\tPhysically capable of manual labor, including lifting heavy equipment •\tStrong work ethic with a focus on punctuality and reliability •\tPrior experience in event setups, tent installations, or manual labor is a plus, but not required •\tAbility to work well in a team environment and follow directions •\tExcellent communication skills and a positive attitude Benefits: •\tCompetitive hourly wage •\tOpportunities for overtime •\tFull-time, stable work •\tPotential for growth within the company If you're hardworking, enjoy physical tasks, and want to contribute to creating unforgettable events, apply today! To Apply:jackie@rentrightnow.com Please submit your resume and a brief cover letter explaining why you're the perfect fit for this role.", "attributes": {}},
{"title": "Hiring Carpenters", "compensation": null, "employment_type": null, "location": "Lake rd near Route 21", "posted_date": "2025-04-11T12:05:05-0400", "url": "https://rochester.craigslist.org/trd/d/pultneyville-hiring-carpenters/7841609911.html", "description": "We are an honest, family oriented, carpentry company based in Williamson, New York focused on delivering experienced craftmanship and the utmost service to our customers. The majority of our business is obtained through word of mouth, and we still must turn jobs away because we simply do not have the crew. Although turning away business is not the best growth model, we are steadfast that each of our employees maintain our company's values. Not the best carpenter?  We can help develop your craftmanship if you match our integrity, respect, dedication and willingness to deliver white-glove level service to our valued customers. Already a great carpenter? Come work for a company that acknowledges your abilities and respects your time off the clock. Part-time and full-time positions are available.  Bring a friend, split the work week, whatever (house)-worxs for you. Still interested? We would like the opportunity to talk in person and discuss all the benefits of being a Houseworx team member. Visit our website at Houseworxonline.com and if you like what you see, apply through the “employment” page or e-mail me directly. If computers are not your thing, visit our office at 4137 Mill St in Williamson. Make the effort to contact us and get the job you want. Thank you for your interest, Josh@Houseworxonline.com Tags: Wayne County, Williamson, 14589, 14505, 14519, 14551, Houseworx, Carpentry, construction, skilled trade, skill trades, job, work, carpenter, carpenters, laborers, Pultneyville", "attributes": {}},
{"title": "LAWN CARE CREW MEMBER- Hiring now!", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-11T12:31:20-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-lawn-care-crew-member-hiring/7841619629.html", "description": "Highly rated Landscape company seeking crew members for mowing season. COMPETITIVE WAGE! Must have 2+ years experience with Commercial Mower (zero turn) and weed wacker/trimmer. Must have valid NYS Drivers License and transportation to and from work. Monday - Friday Greece/Gates area Contact Mike @ 230-0506", "attributes": {}},
{"title": "CDL-A Hazmat Tanker Driver - Day Shift / Local Route", "compensation": null, "employment_type": null, "location": "249 Paul Rd", "posted_date": "2025-04-11T14:02:41-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-cdl-hazmat-tanker-driver-day/7841653016.html", "description": "Join Our Team: CDL-A Drivers Wanted! Crossett, Inc. is hiring CDL-A Professional Drivers! Established in 1928, we pride ourselves on delivering excellent customer service with a focus on safety. Why Choose Us? - Day Shift / Local / Home Daily - $30.27+/hour and overtime available - Monthly & Annual Bonuses - LOW-COST Top-Tier Benefits – Medical/Vision/Dental/401k - Paid Holidays & Vacation - Life & Disability Insurance - Free Flame-Resistant Uniforms - New, Well-Maintained Equipment Job Responsibilities: - Safely transport materials in tanker trucks - Follow traffic laws & ensure safety - Load/unload materials - Pre/post-trip inspections - Maintain accurate records - Communicate with dispatch & customers Requirements: - CDL Class A with Tanker & Hazmat endorsements - Clean driving record - Strong attention to detail & physical capability Apply today to enjoy great pay, home time, and excellent benefits!", "attributes": {}},
{"title": "Experienced Painter Needed", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-11T14:32:25-0400", "url": "https://rochester.craigslist.org/lab/d/webster-experienced-painter-needed/7841663189.html", "description": "PLEASE READ AD BEFORE CONTACTING ME. Remember you are looking for a job..you can text me or call me I am available. Don't contact me and tell me to call you. Life doesn't work that way. Don't send me pictures of your work. A brief description of job and pay. Read below: Work is a combination of interior and exterior work but primarily exterior right now due to season approaching. Weather is tough so getting hours is a challenge. I can not guarantee 40 hours a week right now. Pay comes on Friday worst case scenario. I offer more than one payroll per week as we often do 2 or 3 day jobs. With that being said TOUCH UPS will be,at a minimal or things will not work out as that is a immediate sign of you being careless or incompetent. This particular position is currently for local Monroe County N.Y. work. Minimal limited interaction with the customers is accepted and tolerated. This is to be professional and to avoid confusion. No Smoking of any kind inside any of the jobsites or within 100 feet of the jobsite. Not looking for interior only individuals. Not looking to subcontract work. No I'm not looking for managers or to share work. I am on all job sites applicating steadily with my employees not working remotely barking orders over the phone. I am insured, licensed in several states Certified Building Analyst, BPI certifications,OSHA Certified amongst many other certifications.l and qualifications. I am the lead painter for over a dozen International Trade Show companies. I am always accountable and 100% debt free. With that being said I am not \"PATTING MYSELF ON MY BACK I AM STATING I CAN SEE THROUGH YOUR BULLSHIT IF YOU DON'T WANT TO WORK AND MAKE EXCUSES.\" Payroll is guaranteed in cash. I am a very ,very small very steady sole proprietorship. This is not a corporate FAIRY TALE..we are a little rough around the edges and always will be. Pay starts at $22.00 per hour. It increases as you steadily produce in a manner that is consistent with a responsible tradesman. Continuously meeting the daily tasks which are elementary and fundamental. Hourly pay increases from there. Guaranteed! Requirements: Be able to arrive daily. At least 2 years of verifiable local painting experience. You need to own professional contractors brushes and hand tools such as: 5 in 1, scrapers, wire brush, putty knife, screw drivers, wiz handle and razor knife. That's all, I provide everything else. Don't show up with make up brushes and tell me I need tape and the wall is the problem....either you can or can not! IMPORTANT : You must own your own Painters Whites ( that is bottom clothing or white pants/shorts for those of you that call and ask me what painter whites are!) You can purchase at most supply houses or online. IMPORTANT : The ability  to safely carry a 28' extension ladder and work comfortably off of the ladder at that height. Please do not contact me unless you can do this. I really don't need to discuss anything at all further if you can not work heights. I'm not discriminating. That is a requirement. Please don't contact me. It's a waste of time. IMPORTANT: Your own vehicle that you solely can use on a daily basis to get you to the job sites. Must speak and understand the English Language. DON'T APPLY IF YOU CAN NOT MEET THESE MINIMAL BASIC REQUIREMENTS. INCENTIVES INCLUDE: CASH PAY, WEEKLY CASH PAY, BONUSES, GOOD JOB SITES, A REGULAR CUSTOMER BASE, FREE LUNCH, FREE UNIFORMS, POTENTIAL TO TRAVEL TO LAS VEGAS FOR CONVENTION WORK DURING TRADE SHOW SEASON, ALL EQUIPMENT NEEDED IS PROVIDED ,THE USE OF QUALITY MATERIALS AND THE STAFF AT THE SUPPLY HOUSES ALWAYS TREAT YOU IN A PROFESSIONAL MANNER. IN CLOSING: I've heard all the excuses and lies...you agreed to do a job for a agreed wage, you heard and read the job descriptions and accepted the job. Just do it.. If you read this ad and are interested in the job call me and tell me your favorite band or sports team or vacation place so I know that you read this job description. If not you can't follow a job description then  we are ALREADY OFF TO A BAD START....UNDERSTAND??", "attributes": {}},
{"title": "Roofer", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-11T14:35:17-0400", "url": "https://rochester.craigslist.org/trd/d/webster-roofer/7841664117.html", "description": "Hiring experienced flat roofers with at least 5 years of experience.  Experience with bolting and screwing down insulation, sealing, coating, and caulking of finished roof, and basic installation of flat roof.  Must be from Monroe or surrounding county.  Must have current license or id that reflects location requirement.  OSHA 10 is required as well as transportation, and work boots.  All other basic ppe can be provided.  Everyone will be required to complete a safe matters training course before starting.  If interested respond with name, phone number, and email address.", "attributes": {}},
{"title": "Plumber", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-11T14:36:12-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-plumber/7841664384.html", "description": "Hiring plumbers with at least 2 years of experience in repairing and maintaining plumbing systems.  Must be able to read blueprints and lay pipework.  Reliable transportation and basic tools are necessary.  Pay is $20 to $29 an hour based on experience.  OSHA is a plus or will be provided.  If interested respond with first and last name, email, and phone number.", "attributes": {}},
{"title": "ALDI - Full-Time Store Associate", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-11T15:18:50-0400", "url": "https://rochester.craigslist.org/ret/d/penfield-aldi-full-time-store-associate/7841679650.html", "description": "APPLY NOW {GDPR};gdpr_consent=${GDPR_CONSENT_755}? Position Type: Full-Time Average Hours: 32-40 hours per week Starting Wage: $19.50 per hour Wage Increases: Year 2 - $20.00 | Year 3 - $20.50 | Year 4 - $20.50 | Year 5 - $21.50 Duties and Responsibilities: Must be able to perform duties with or without reasonable accommodation. • Consistently demonstrate the Mindsets, ALDI Acts Competencies and Professional Skills (M.A.P.) as outlined for the role. • Processes customer purchases, perform general cleaning duties, stocks shelves and merchandise displays neatly • Provide exceptional customer service, assisting customers with their shopping experience • Collaborate with team members and communicate clearly to the store management team • Provide feedback to management on all products, inventory losses, scanning errors, and general issues • Participate in taking store inventory counts according to guidelines and monitoring inventory for accuracy • Adheres to cash policies and procedures to minimize losses • Complies with all established company policies and procedures while upholding the security and confidentiality of documents and data • Other duties as assigned Physical Demands: • Ability to stock merchandise from store receiving to shelving; ability to place product, weighing up to 45 pounds, on shelving at various heights • Regularly required to sit, stand, bend, reach, push, pull, lift, carry and walk about the store • Must be able to perform duties with or without reasonable accommodation Qualifications: • You must be 18 years of age or older to be employed for this role at ALDI • Ability to provide prompt and courteous customer service • Ability to operate a cash register efficiently and accurately • Ability to safely and properly operate equipment, including electric/manual hand jack, floor scrubber, and cardboard baler • Ability to perform general cleaning duties to company standards • Ability to interpret and apply company policies and procedures • Excellent verbal and written communication skills • Ability to work both independently and within a team environment • Ability to stay organized, give attention to detail, follow instructions and multi-task in a professional and efficient manner • Meet any state and local requirements for handling and selling alcoholic beverages Education and Experience: • High School Diploma or equivalent preferred • Prior work experience in a retail environment preferred • A combination of education and experience providing equivalent knowledge ALDI offers competitive wages and benefits, including: 401(k) Plan Company 401(k) Matching Contributions Employee Assistance Program (EAP) PerkSpot National Discount Program In addition, eligible employees are offered: Medical, Prescription, Dental & Vision Insurance Generous Vacation Time & 7 Paid Holidays Up to 6 Weeks Paid Parental Leave at 100% of pay Up to 2 Weeks Paid Caregiver Leave at 100% of pay Short and Long-Term Disability Insurance Life, Dependent Life and AD&D Insurance Voluntary Term Life Insurance ALDI is committed to equal opportunity for all employees and applicants. As a proud Equal Opportunity Employer (EOE), we do not discriminate based on race, color, national origin, ancestry, citizenship status, religion, sex, sexual stereotyping, sexual orientation, gender, gender identity, gender expression, age, marital status, mental or physical disability, medical condition, genetic information, military or veteran status, pregnancy (which includes pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), or any other protected characteristic. Employment may be contingent upon ALDI's receipt of an acceptable and job-related drug test, motor vehicle report, and/or reference check, as applicable and permissible by law.", "attributes": {}},
{"title": "ALDI - Part-Time Store Cashier/Stocker", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-11T15:20:09-0400", "url": "https://rochester.craigslist.org/ret/d/penfield-aldi-part-time-store-cashier/7841680091.html", "description": "APPLY NOW {GDPR};gdpr_consent=${GDPR_CONSENT_755}? Position Type: Part-Time Average Hours: Fewer than 30 hours per week Starting Wage: $19.50 per hour Wage Increases: Year 2 - $20.00 | Year 3 - $20.50 | Year 4 - $20.50 | Year 5 - $21.50 Duties and Responsibilities: Must be able to perform duties with or without reasonable accommodation. • Collaborates with team members and communicates relevant information to direct leader • Upholds the security and confidentiality of documents and data within area of responsibility • Other duties as assigned Cashier Responsibilities: • Processes customer purchases, performs general cleaning duties, stocks shelves and merchandise displays neatly • Provides exceptional customer service, assisting customers with their shopping experience • Provides feedback to management on all products, inventory losses, scanning errors, and general issues • Participates in taking store inventory counts according to guidelines and monitoring inventory for accuracy • Adheres to cash policies and procedures to minimize losses Stocker Responsibilities: • Stocks shelves and rotates product properly to guarantee fresh product is available for the customer • Follows merchandising planograms to create excellently merchandised displays • Organizes new inventory, removes and breaks down empty boxes • Operates machinery and follows all safety procedures Physical Demands: • Regularly required to sit, stand, bend, reach, push, pull, lift, carry, and walk about the store • Stocker: Ability to stock merchandise from store receiving to shelving; ability to place product, weighing up to 45 pounds, on shelving at various heights Qualifications: • You must be 18 years of age or older • Ability to provide prompt and courteous customer service • Ability to perform general cleaning duties to company standards • Ability to interpret and apply company policies and procedures • Excellent verbal communication skills • Ability to work both independently and within a team environment • Effective time management • Knowledge of products and services of the company • Cashier: Ability to operate a cash register efficiently and accurately • Cashier: Comply with state and local requirements for handling and selling alcoholic beverages • Stocker: Ability to operate equipment safely and properly, including electric/manual hand jack, floor scrubber, and cardboard baler Education and Experience: • High School Diploma or equivalent preferred • Prior work experience in a retail environment preferred • A combination of education and experience providing equivalent knowledge ALDI offers competitive wages and benefits, including: 401(k) Plan Company 401(k) Matching Contributions Employee Assistance Program (EAP) PerkSpot National Discount Program In addition, eligible employees are offered: Medical, Prescription, Dental & Vision Insurance Generous Vacation Time & 7 Paid Holidays Up to 6 Weeks Paid Parental Leave at 100% of pay Up to 2 Weeks Paid Caregiver Leave at 100% of pay Short and Long-Term Disability Insurance Life, Dependent Life and AD&D Insurance Voluntary Term Life Insurance ALDI is committed to equal opportunity for all employees and applicants. As a proud Equal Opportunity Employer (EOE), we do not discriminate based on race, color, national origin, ancestry, citizenship status, religion, sex, sexual stereotyping, sexual orientation, gender, gender identity, gender expression, age, marital status, mental or physical disability, medical condition, genetic information, military or veteran status, pregnancy (which includes pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), or any other protected characteristic. Employment may be contingent upon ALDI's receipt of an acceptable and job-related drug test, motor vehicle report, and/or reference check, as applicable and permissible by law.", "attributes": {}},
{"title": "ALDI - Full-Time Store Associate", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-11T15:21:34-0400", "url": "https://rochester.craigslist.org/ret/d/fairport-aldi-full-time-store-associate/7841680580.html", "description": "APPLY NOW {GDPR};gdpr_consent=${GDPR_CONSENT_755}? Position Type: Full-Time Average Hours: 32-40 hours per week Starting Wage: $19.50 per hour Wage Increases: Year 2 - $20.00 | Year 3 - $20.50 | Year 4 - $20.50 | Year 5 - $21.50 Duties and Responsibilities: Must be able to perform duties with or without reasonable accommodation. • Consistently demonstrate the Mindsets, ALDI Acts Competencies and Professional Skills (M.A.P.) as outlined for the role. • Processes customer purchases, perform general cleaning duties, stocks shelves and merchandise displays neatly • Provide exceptional customer service, assisting customers with their shopping experience • Collaborate with team members and communicate clearly to the store management team • Provide feedback to management on all products, inventory losses, scanning errors, and general issues • Participate in taking store inventory counts according to guidelines and monitoring inventory for accuracy • Adheres to cash policies and procedures to minimize losses • Complies with all established company policies and procedures while upholding the security and confidentiality of documents and data • Other duties as assigned Physical Demands: • Ability to stock merchandise from store receiving to shelving; ability to place product, weighing up to 45 pounds, on shelving at various heights • Regularly required to sit, stand, bend, reach, push, pull, lift, carry and walk about the store • Must be able to perform duties with or without reasonable accommodation Qualifications: • You must be 18 years of age or older to be employed for this role at ALDI • Ability to provide prompt and courteous customer service • Ability to operate a cash register efficiently and accurately • Ability to safely and properly operate equipment, including electric/manual hand jack, floor scrubber, and cardboard baler • Ability to perform general cleaning duties to company standards • Ability to interpret and apply company policies and procedures • Excellent verbal and written communication skills • Ability to work both independently and within a team environment • Ability to stay organized, give attention to detail, follow instructions and multi-task in a professional and efficient manner • Meet any state and local requirements for handling and selling alcoholic beverages Education and Experience: • High School Diploma or equivalent preferred • Prior work experience in a retail environment preferred • A combination of education and experience providing equivalent knowledge ALDI offers competitive wages and benefits, including: 401(k) Plan Company 401(k) Matching Contributions Employee Assistance Program (EAP) PerkSpot National Discount Program In addition, eligible employees are offered: Medical, Prescription, Dental & Vision Insurance Generous Vacation Time & 7 Paid Holidays Up to 6 Weeks Paid Parental Leave at 100% of pay Up to 2 Weeks Paid Caregiver Leave at 100% of pay Short and Long-Term Disability Insurance Life, Dependent Life and AD&D Insurance Voluntary Term Life Insurance ALDI is committed to equal opportunity for all employees and applicants. As a proud Equal Opportunity Employer (EOE), we do not discriminate based on race, color, national origin, ancestry, citizenship status, religion, sex, sexual stereotyping, sexual orientation, gender, gender identity, gender expression, age, marital status, mental or physical disability, medical condition, genetic information, military or veteran status, pregnancy (which includes pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), or any other protected characteristic. Employment may be contingent upon ALDI's receipt of an acceptable and job-related drug test, motor vehicle report, and/or reference check, as applicable and permissible by law.", "attributes": {}},
{"title": "ALDI - Part-Time Store Cashier/Stocker", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-11T15:22:58-0400", "url": "https://rochester.craigslist.org/ret/d/webster-aldi-part-time-store-cashier/7841681097.html", "description": "APPLY NOW {GDPR};gdpr_consent=${GDPR_CONSENT_755}? Position Type: Part-Time Average Hours: Fewer than 30 hours per week Starting Wage: $19.50 per hour Wage Increases: Year 2 - $20.00 | Year 3 - $20.50 | Year 4 - $20.50 | Year 5 - $21.50 Duties and Responsibilities: Must be able to perform duties with or without reasonable accommodation. • Collaborates with team members and communicates relevant information to direct leader • Upholds the security and confidentiality of documents and data within area of responsibility • Other duties as assigned Cashier Responsibilities: • Processes customer purchases, performs general cleaning duties, stocks shelves and merchandise displays neatly • Provides exceptional customer service, assisting customers with their shopping experience • Provides feedback to management on all products, inventory losses, scanning errors, and general issues • Participates in taking store inventory counts according to guidelines and monitoring inventory for accuracy • Adheres to cash policies and procedures to minimize losses Stocker Responsibilities: • Stocks shelves and rotates product properly to guarantee fresh product is available for the customer • Follows merchandising planograms to create excellently merchandised displays • Organizes new inventory, removes and breaks down empty boxes • Operates machinery and follows all safety procedures Physical Demands: • Regularly required to sit, stand, bend, reach, push, pull, lift, carry, and walk about the store • Stocker: Ability to stock merchandise from store receiving to shelving; ability to place product, weighing up to 45 pounds, on shelving at various heights Qualifications: • You must be 18 years of age or older • Ability to provide prompt and courteous customer service • Ability to perform general cleaning duties to company standards • Ability to interpret and apply company policies and procedures • Excellent verbal communication skills • Ability to work both independently and within a team environment • Effective time management • Knowledge of products and services of the company • Cashier: Ability to operate a cash register efficiently and accurately • Cashier: Comply with state and local requirements for handling and selling alcoholic beverages • Stocker: Ability to operate equipment safely and properly, including electric/manual hand jack, floor scrubber, and cardboard baler • Stocker: ALDI Stockers must have morning availability to accommodate store operational responsibilities and be available to work morning shifts with start times as early as 5:00 a.m. Education and Experience: • High School Diploma or equivalent preferred • Prior work experience in a retail environment preferred • A combination of education and experience providing equivalent knowledge ALDI offers competitive wages and benefits, including: 401(k) Plan Company 401(k) Matching Contributions Employee Assistance Program (EAP) PerkSpot National Discount Program In addition, eligible employees are offered: Medical, Prescription, Dental & Vision Insurance Generous Vacation Time & 7 Paid Holidays Up to 6 Weeks Paid Parental Leave at 100% of pay Up to 2 Weeks Paid Caregiver Leave at 100% of pay Short and Long-Term Disability Insurance Life, Dependent Life and AD&D Insurance Voluntary Term Life Insurance ALDI is committed to equal opportunity for all employees and applicants. As a proud Equal Opportunity Employer (EOE), we do not discriminate based on race, color, national origin, ancestry, citizenship status, religion, sex, sexual stereotyping, sexual orientation, gender, gender identity, gender expression, age, marital status, mental or physical disability, medical condition, genetic information, military or veteran status, pregnancy (which includes pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), or any other protected characteristic. Employment may be contingent upon ALDI's receipt of an acceptable and job-related drug test, motor vehicle report, and/or reference check, as applicable and permissible by law.", "attributes": {}},
{"title": "$1400 - $1525 Starting Salary! -- Home Every Weekend -- 4 Weeks of PTO", "compensation": null, "employment_type": null, "location": "60-62 Franklin Avenue", "posted_date": "2025-04-11T17:01:01-0400", "url": "https://rochester.craigslist.org/trp/d/dunkirk-starting-salary-home-every/7841710864.html", "description": "", "attributes": {}},
{"title": "Line Cooks", "compensation": null, "employment_type": null, "location": "3939 E Henrietta Rd", "posted_date": "2025-04-11T17:27:08-0400", "url": "https://rochester.craigslist.org/fbh/d/henrietta-line-cooks/7841718128.html", "description": "Fireside Grill is looking to add to our kitchen team. Line Cook -part-time position 2-3 Dinner/ Closing shifts- 4pm-Midnight Requirements: * Prior experience required. * Serve-safe food handler or manager certified. * Create and prepare dinner features. * Read and follow recipes, prepare menu items according to our specifications * Set-up line and maintain inventory for the day * Follow opening, closing check lists, including proper cleaning and sanitation equipment. * Knife skills are expected for slicing, chopping, peeling, preparation of product * Sauté &  Grill station proficient. * Clean as you go and maintain properly sanitized workstations, ensure compliance with food safety and handling policies and procedures * Work in a fast paced, busy environment * Be able to lift, move up to 50lbs * Must be able continuously stand on feet for 8 consecutive hours during work shift. * Follow direction and think ahead * Work together as a team to give our guests the best fresh meal * Prep menu items as needed * Stock food items on line at end of shift * Turn off , Clean all equipment Team-work is critical in the success and development of our team. We are open 7 days a week, closed on major holidays * Respond with resume & phone number * Come in and complete an application in person 3939 E. Henrietta Rd Henrietta, NY 14467 * Call 585-486-4611 to set up interview", "attributes": {}},
{"title": "Regional Class A Drivers", "compensation": null, "employment_type": null, "location": "3111 S Winton Rd", "posted_date": "2025-04-11T18:15:26-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-regional-class-drivers/7841731842.html", "description": "Are you making $2500 per week or more and home some week nights and on weekends? We are growing again and need to add a few drivers our spots are limited and we are only looking for the best drivers. Running mainly PA, VA, MD, DE, NJ, OH, GA, NC, SC, MA, CT, RI, VT, NH, ME. Hauling dry and temp controlled shipments. All equipment is assigned and well maintained. Pay is 25% of gross paid holidays, 2 weeks paid vacation, paid medical after 90 days. If interested please call 585-303-2950", "attributes": {}},
{"title": "Local Class A Drivers Needed", "compensation": null, "employment_type": null, "location": "3111 S Winton Rd", "posted_date": "2025-04-11T18:16:43-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-local-class-drivers-needed/7841732189.html", "description": "Currently Hiring Class A drivers for local Days & Nights running mainly New York and some parts of Pennsylvania .  Hauling Dry Van, Reefer or Flatbed. This is a full time year round position. Will also have positions available for part time and weekend.  Must have at least 1 year driving class A vehicles. Call 585-303-2950", "attributes": {}},
{"title": "Heavy Duty Truck & Trailer Mechanic", "compensation": null, "employment_type": null, "location": "3111 S Winton Rd", "posted_date": "2025-04-11T18:18:54-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-heavy-duty-truck-trailer/7841732705.html", "description": "Nordic Truck And Trailer is currently looking for a truck and trailer mechanic to work on class 8 tractors and trailers. Must have experience working on trucks and trailers must have own tools, we provide plenty of support tools and equipment. Starting pay is $30-$40 per hour based on experience. 2 weeks paid vacation paid holidays and paid medical after 90 days. Start immediately limited position looking for the right guy that’s looking to retire from company not looking for job hoppers.", "attributes": {}},
{"title": "Dishwashers", "compensation": null, "employment_type": null, "location": "3670 lake rd near 104 and 19", "posted_date": "2025-04-11T21:10:16-0400", "url": "https://rochester.craigslist.org/fbh/d/clarkson-dishwashers/7841768845.html", "description": "Full-time/part time", "attributes": {}},
{"title": "Nights Janitor/Cleaner Downtown", "compensation": null, "employment_type": null, "location": "Jefferson Road near Winton Road", "posted_date": "2025-04-11T21:13:42-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-nights-janitor-cleaner/7841769380.html", "description": "West Main st. Downtown Rochester: General office cleaning. Monday through Friday start at 5:00 p.m. 13 hrs. per. week. $16.75 per hr. Some experience necessary. This is on a bus line. We do not pay under the table.", "attributes": {}},
{"title": "Class C Delivery Driver- Rochester- PART TIME- $32/hr", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-11T23:00:08-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-class-delivery-driver/7841783759.html", "description": "", "attributes": {}},
{"title": "Winfield Grill Hiring - Line Cook", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-12T08:30:33-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-winfield-grill-hiring-line/7841821054.html", "description": "Busy restaurant looking to hire a line cook. This is a full time position. Experience is always a plus and pay is competitive Training and opportunities for advancement available! Open Tuesday through Saturday, so you'll have 2 consecutive days off. Attach your resume with a valid contact number Or stop by before 11am or after 3pm please We are a family oriented restaurant, and we hope you'll join our family!", "attributes": {}},
{"title": "HIRING COOKS/LINE COOKS for FAMILY RESTAURANT", "compensation": null, "employment_type": null, "location": "Buffalo road", "posted_date": "2025-04-12T10:35:48-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-hiring-cooks-line-cooks-for/7841845953.html", "description": "Looking to hire cooks for high volume diner/restaurant mainly evening shifts tuesday, Wednesday, Thursday, Friday and saturday With Possible days during the week and weekends as well. Pay negotiable. Competitive salary MUST have experience working in a diner/family restaurant setting for over 2 years Do Not apply if you have not worked in high volume.  Hours and days negotiable based on experience", "attributes": {}},
{"title": "70 CPM! $2000 Top Weeks! $1K Bonus! Recruiters Available Today!", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-12T12:00:54-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-70-cpm-2000-top-weeks-1k/7841869155.html", "description": "", "attributes": {}},
{"title": "Concrete Finisher wanted", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-12T16:34:33-0400", "url": "https://rochester.craigslist.org/trd/d/brockport-concrete-finisher-wanted/7841953685.html", "description": "Looking for a skilled mason to work on residential and commercial projects. 40 hours a week minimum, all tools provided, other benefits offered after a seasoning period. (Cell phone, gas, possible retirement savings match)", "attributes": {}},
{"title": "Bob’s Diner host/Hostess", "compensation": null, "employment_type": null, "location": "2199 East Henrietta rd", "posted_date": "2025-04-12T16:55:17-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-bobs-diner-host-hostess/7841959257.html", "description": "Bob’s Diner is looking for a host/hostess for a fast paced family diner. Duties include seating and cashing out customers, bussing tables, answering phone and taking takeout orders. Pay is minimum wage plus any takeout tips. Please fill out an application in person 2199 East Henrietta rd 8am-2pm daily No phone calls", "attributes": {}},
{"title": "Window and door installer /helper", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-12T19:17:56-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-window-and-door-installer/7841991662.html", "description": "Local construction company looking for skilled window and door installer and installation helper. Must have own transportation and basic hand tools. Experience preferred but will train the right person.", "attributes": {}},
{"title": "mover/part time", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-13T12:33:02-0400", "url": "https://rochester.craigslist.org/lab/d/east-rochester-mover-part-time/7842103943.html", "description": "Part-time mover $19 hr plus tips. Help load truck. Heavy lifting. Start location will be in Pittsford area. Need reliable transportation. Please text a brief employment history to 716-432-0354 .", "attributes": {}},
{"title": "Caregiver needed. AM & PM", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-13T15:54:55-0400", "url": "https://rochester.craigslist.org/hea/d/batavia-caregiver-needed-am-pm/7842154749.html", "description": "Need. caregiver for 93 year old father. Mind is great and sharp as a tac. Very easy going. needs assitance in the am coming down stairs and evening going up stairs. light supervision. Good job for extra cash. call with details and rate.", "attributes": {}},
{"title": "VOLUNTEERS NEEDED at Mockingbird Farm Sanctuary", "compensation": null, "employment_type": null, "location": "5978 Upper Holley Rd", "posted_date": "2025-04-13T17:12:26-0400", "url": "https://rochester.craigslist.org/npo/d/byron-volunteers-needed-at-mockingbird/7842172950.html", "description": "We are expanding our team of volunteers! Our mission at Mockingbird Farm Sanctuary is to provide lifetime sanctuary to farmed animals with donations solely benefiting direct animal care. We believe in treating all beings with compassion and respect, and we strive to promote a cruelty-free lifestyle. We have daily, monthly, and special event volunteer opportunities that are always available. Anyone is welcome and encouraged to apply. Mockingbird Farm Sanctuary has been a place of refuge for farm animals since its inception in 2015. Our journey is fueled by the desire to create a world where every animal is valued and protected. We rescue abused, surrendered and/or neglected farmed animals and provide community resources for living a compassionate lifestyle. No prior farm experience is required, but any animal caretaking knowledge and farm related skills are helpful. All volunteers are trained and provided with any support needed. Please email us for more information. The following questions help us find the best schedule and placement at the sanctuary. Have you ever volunteered at an animal sanctuary before? Do you have large animal experience? What is your availability for volunteering? Do you have reliable transportation? How did you find Mockingbird and why would you like to volunteer? ​ EIN: 821517678 - Established in 2015  - 501(c)3 granted in 2017 Thank you!", "attributes": {}},
{"title": "Bartender", "compensation": null, "employment_type": null, "location": "109 East Avenue near Gibbs St.", "posted_date": "2025-04-13T20:03:58-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-bartender/7842206182.html", "description": "Temple Bar & Grille is looking for strong & knowledgeable bartender with open availability for nights and weekends. Include resume when responding to this post.", "attributes": {}},
{"title": "Better Than Free - PAID CDL TRAINING!!", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-13T20:28:02-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-better-than-free-paid-cdl/7842211027.html", "description": "We'll pay you while you get your CDL. If you qualify for our program, training to obtain your CDL is part of your job. Once you have your CDL, you'll continue getting paid on the job training with a Driver Trainer (about 3 weeks). After you have your CDL, you'll continue your on-the-job training as a long-haul professional truck driver. From there, Roehl drivers are making $70,000 or more a year. Here's an overview of the Get Your CDL Program: You'll be paid as you get your CDL in our three-week CDL training program. Training is available in multiple locations. You are hired and paid as an employee on day 1. If you were to go to a CDL school, you would not get paid while you are training AND you'd have to come up with the tuition for the school. We're a stable company that provides full benefits - we invest in you. Get Started on Roehl.Jobs If you contact Roehl by email, please include your first name, last name, email address, phone number, zip code and if you already have Class A CDL in your message so we can connect with you. You can also provide this information on our website. You can also call us at 715-591 7050, option 8, then option 2. Keyword search: Driving, transportation, drivers, cdla, cdl-a, class a, truckers, job, truck driver jobs, driving jobs near me, local truck driving jobs, best companies to drive for, salary, paid truck driver job, truck driving school, commercial learning permit, CDL training schedule, student truck driver jobs, paid CDL-A truck driver training, paid training Benefits: Health Insurance, Dental Insurance, Long-Term Disability (LTD), Life Insurance: Basic & Supplemental, Short-Term Income Protection, Flexible Spending Accounts (FSAs), 401(k) & Profit-sharing Contributions, Vacation, Holidays, Voluntary Benefits. See more about Roehl Transport's benefits by visiting", "attributes": {}},
{"title": "1099 Residential Door Estimator", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-13T22:00:29-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-1099-residential-door/7842224168.html", "description": "Job Title: 1099 Residential Door Estimator Location: Rochester, NY Employment Type: Independent Contractor (1099) Company Overview: We are a growing home improvement and construction services provider specializing in residential door sales and installations throughout the general Rochester, NY area. Known for our attention to detail, and excellent customer service, we are looking for an experienced Residential Door Estimator to join our team on a contract basis. Position Summary: We are seeking a detail-oriented and knowledgeable estimator to assess residential properties, take accurate measurements, and provide the appropriate details for replacements and installations. This is a 1099 contractor position with flexible scheduling and competitive compensation. Responsibilities: Travel to residential sites within the Rochester surrounding area to assess door replacement or installation needs Measure and evaluate openings to determine correct door sizes and materials Prepare detailed and accurate project estimates, including addition materials needed Collaborate with sales and installation teams to ensure accurate project scope as needed Communicate professionally with homeowners to explain processes and answer questions Maintain thorough documentation and follow-up as needed Qualifications: Proven experience in residential door estimating, installations, carpentry, or related field Strong understanding of door types, materials, hardware, and installation practices Ability to accurately measure and assess job sites Excellent communication and customer service skills Self-motivated, organized, and dependable Valid driver’s license, auto insurance, and reliable transportation Ability to pass a background check Compensation: Competitive pay (rate based on experience) Flexible hours and autonomy in schedule To Apply: Please submit your resume and a brief introduction outlining your experience with residential door estimating. Include your availability and contact information.", "attributes": {}},
{"title": "Skilled Trades Mentorship Program", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-14T07:31:46-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-skilled-trades-mentorship/7842260362.html", "description": "Do you have base level experience in remodeling but want a CAREER as a skilled trades expert? The Pink Rose Mentorship is exactly what you are looking for! Our Service Experts have top level experience in the industry, and they want to train you! That’s right! Hands on, one on one, in-field experience with a professional! You won’t get forgotten about on a crew. You aren’t paying to go to school, we are paying you to train! And if you “graduate” you’ll become one of our Service Experts. They make $60,000 -$100,000 a year! Our top earner in 2024 was $93,378 We focus on residential home improvement. Small, one-person jobs involved in the skilled trades. Plumbing Electrical Carpentry Drywall Painting Carpentry (Framing and Trim) Windows/Doors Flooring Tile (flooring and backsplashes) “Handyman” Projects Requirements: -some basic background or experience with remodeling/ skilled trades work. -Valid & clean NYS driver’s license -Reliable transportation -Be able to lift 50 IBS -High school graduate or have GED Benefits include: ·\tCompany Phone ·\tCompany uniform including shirts, pants, hats, sweatshirts and windbreaker ·\tWeekends off ·\tNo overnight travel ·\t8 paid holidays including your birthday ·\tPaid sick time ·\t401k matching after 6 months ·\tReferral bonus: $1,000 bonus if we hire a service expert you refer. Pay is $15 per hour to start. You can also apply by going to our website, pink-rose.com/now-hiring Thank you for your time.", "attributes": {}},
{"title": "Quit Your Job and Start your CAREER. Skilled Handyman. $5000 Sign-On!!", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-14T07:32:20-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-quit-your-job-and-start-your/7842260397.html", "description": "Highly established & rated company in Rochester NY, looking to hire YOU. And right now we are offering a $5,000 sign-on bonus!! Earning Potential $60,000 - $100,000 per year. You will be paid based on performance. Top Earner in 2024: $93,378 We offer: ·\tCompany van with a gas card ·\tCan drive van home if you live within a 35/mile radius of the office. ·\tCompany Phone ·\tCompany uniform including shirts, pants, hats, sweatshirts and windbreaker ·\tWeekends off (overtime is available but NEVER forced) ·\tNo overnight travel ·\t8 paid holidays including your birthday ·\tPaid sick time ·\tWeekly and monthly bonus potential ·\tPaid training to learn our system and policies ·\tTool allowance ·\tLots of office support ·\tCompany equipment can be borrowed. (ext. ladders, brake, power-washer, scaffolding) Plus: ·\tPaid time off starting in the new calendar year ·\t401k matching after 6 months ·\tCompany credit card after first month ·\tReferral bonus: $1,000 bonus if we hire someone you refer. ·\tHundreds of appointments and jobs throughout the year ·\tUse your full skill set!! Not doing the same thing every single day! We complete smaller interior home improvement projects & repairs focused on the skilled trades. Plumbing\t\tElectrical\t\tDrywall/Painting\t\tCarpentry Windows/Doors\tTile\t\t\tFlooring Some jobs may be small (ex. changing a faucet, installing a ceiling fan, patching a drywall hole.) Other jobs may be more involved or a punch list of different tasks to be completed. You will be dispatched to individual appointments, provide a quote for the work and complete each job sold. (Paid training provided to understand our pricing!) The office handles all the scheduling and back-office support that way you can focus on what you’re good at; helping homeowners and using your craft. NO whole house jobs. NO new construction or new builds NO major projects: Decks, sunrooms, complete kitchen remodels, complete bathroom remodels, additions, roof tear offs. NO Crews. You will work by yourself on your own jobs! Requirements: ·\tYou need to have professional experience, 5 years minimum in most the skilled trades. ·\tYour own tools (basic hand tools, power tools.) ·\tAbility to have customer interaction. ·\tCLEAN and VALID New York State Driver’s License. ·\tNOT a position for beginners, DIY’ers, or Apprentices. (We do have a mentorship program) ·\tFull-time, year-round requirement (40 hours/week, weekends off) ·\tNO subcontractors. ·\tNo under the table pay. ·\tNO Riff Raff. Clean company = clean techs ·\tYou must be smart and be able to problem solve and critically think through certain jobs. We can’t wait to talk further with you. Respond with your phone # and brief work history or resume. Check out our website to learn more about us:\tPink-Rose.com", "attributes": {}},
{"title": "Bathroom Installer. $5000 Sign-On Bonus!!", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-14T07:32:42-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-bathroom-installer-5000-sign/7842260434.html", "description": "Highly established & rated company looking to hire YOU. And right now, we have a $5000 sign-on bonus!! Earning Potential $60,000 - $80,000per year. You will be paid based on performance. We offer: ·\tCompany van with a gas card ·\tCan drive van home if you live with 35/mile radius of the office. ·\tCompany Phone ·\tCompany uniform including shirts, pants, hats, sweatshirts and windbreaker ·\tWeekends off ·\tNo overnight travel ·\t8 paid holidays including your birthday ·\tPaid sick time ·\tWeekly and monthly bonus potential ·\tPaid training to learn our system and policies ·\tTool allowance ·\tLots of office support ·\tCompany equipment can be borrowed. (ext. ladders, brake, power-washer, scaffolding) Plus: ·\tPaid time off starting in the new calendar year ·\t401k matching after 6 months ·\tCompany credit card after first month ·\tReferral bonus: $1,000 bonus if we hire someone you refer. ·\tScheduling is all taken care of by the office. We only remodel existing bathrooms. No closet to bathroom conversions, no jobs involved with moving the plumbing locations. Jobs include demo existing fixtures and tub/shower, installing a new tub/shower pan & surround, installing a new floor, painting, installing a vanity and toilet, installing new trim, installing a new vent fan & vanity light fixture and more.  We do a lot of tile surrounds and floors. These jobs are one person jobs. A helper is available on occasions. The office handles all the scheduling and back-office support that way you can focus on what you’re good at; helping homeowners and using your craft. Requirements: You need to have professional experience, 5 years minimum in most the skilled trades. You need to be proficient with plumbing and the tub/shower installations.  We install either a fiberglass, glue up or tile surround and you need to be experienced with all types. Plumbing\t\tElectrical\t\tDrywall/Painting\t\tCarpentry Windows/Doors\tTile\t\t\tFlooring ·\tYour own tools (everything to be able to remodel a bathroom.) ·\tCLEAN and VALID New York State Driver’s License. ·\tNOT a position for beginners, DIY’ers, or Apprentices. (We do have a mentorship program) ·\tFull-time, year-round requirement (40 hours/week, weekends off) ·\tNO subcontractors. ·\tNo under the table pay. ·\tNO Riff Raff. Clean company = clean installers ·\tYou must be smart and be able to problem solve and critically think through certain jobs We can’t wait to talk further with you. Respond with your phone # and brief work history or resume. Check out our website to learn more about us:\tPink-Rose.com", "attributes": {}},
{"title": "Janitor / Cleaning", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-14T08:43:59-0400", "url": "https://rochester.craigslist.org/lab/d/henrietta-janitor-cleaning/7842268719.html", "description": "Janitor / Cleaning FULL - TIME DAY Position Warehouse Cleaning Monday thru Friday 6:00am - 2:30pm $17.00/Hr. Call 716-854-0841 for more information and to place your name on the Interview List.", "attributes": {}},
{"title": "Class A and B CDL Drivers Wanted Local Delivery Albion, NY", "compensation": null, "employment_type": null, "location": "3854 Taylor Hill Rd", "posted_date": "2025-04-14T09:41:55-0400", "url": "https://rochester.craigslist.org/trp/d/knowlesville-class-and-cdl-drivers/7842279843.html", "description": "Job Overview: Growmark FS, LLC located in Albion, NY is seeking Class A and Class B qualified drivers immediately to join our team! Most trucking occurs within 50 mile radius of Albion, NY meaning home every night. Applicant must have clean license. Full time and part time positions available. We offer a benefit package for full time employees including medical, vacation, life insurance, and 401k company match! Pay range is negotiable based on position and experience. Please email your resume or apply in person. Our office is located at 3854 Taylor Hill Rd Albion, NY 14411. You can also check out and apply through our website at . Contact us TODAY! Principals only. Recruiters, please don't contact this job poster.", "attributes": {}},
{"title": "Construction site superintendent", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-14T09:46:45-0400", "url": "https://rochester.craigslist.org/trd/d/ontario-center-construction-site/7842280952.html", "description": "Seeking experienced construction superintendent for commercial general contractor. Must be able to supervise multiple onsite subcontractors daily. Someone who has an understanding of construction and is able to read construction drawings/plans. Some basic computer skills for reporting daily logs. Strong communication and organization skills necessary. Ability to professionally handle 3rd party inspections and code enforcement officers. Capable of some physical work. Must be able to follow a provided project schedule, keeping job on track/target. Must have reliable transportation and valid drivers' license. Salary based on experience and capabilities.", "attributes": {}},
{"title": "Cook", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-14T10:33:18-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-cook/7842292920.html", "description": "Full time position for experienced cook for a busy restaurant- must have own transportation-available nights and weekends- please include a resume- pay rate based on experience-", "attributes": {}},
{"title": "Line Cook at Neighborhood Bar", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-14T10:48:02-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-line-cook-at-neighborhood-bar/7842296824.html", "description": "Our well-regarded, small, and local establishment is seeking a reliable Line Cook to join our team. We value professionalism, dependability, and a strong work ethic. Previous experience working solo in a high-paced kitchen environment is preferred. Requirements: -Experience working in a full-service kitchen. -Demonstrated ability to work in a fast-paced kitchen. -Consistent attendance and adherence to scheduled shifts. -Must be ServeSafe certified or willing to obtain certification within 30 days of hire. -Commitment to maintaining high food safety and hygiene standards and a clean work environment. -Must have access to reliable transportation. -Friendly guest communication. Benefits: -A supportive work environment with a small, friendly team and reasonable management. -Streamlined menu and kitchen setup. -Up to 40 hours per week with additional opportunities to earn more. -Opportunity to earn tips in addition to hourly wage! How to Apply: -Please respond with your resume and a brief description of your experience. We are looking for someone who is dedicated and reliable—a perfect fit for our kitchen team.", "attributes": {}},
{"title": "Boat / PWC Mechanic(s) Wanted", "compensation": null, "employment_type": null, "location": "1070 Empire Blvd", "posted_date": "2025-04-14T10:50:26-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-boat-pwc-mechanics-wanted/7842297484.html", "description": "McMillan Marine is looking for experienced Boat and PWC mechanics as well as new unit prep technicians in the marine field. *Top pay, Health Care, 401K per qualification *Experience with inboard/outboard, outboard, jet drive, and PWC helpful. *Experience in the Yamaha Motorsports industry or jet drive industry helpful *Yamaha Outboard, Yamaha Jet Drive, Mercruiser, Volvo Dealer *Certified mechanics a plus but all others considered. *Must be dependable and customer conscious. *Very large and clean shop environment. *On water location. *All levels of experience will be considered for various positions *Job Types: Full-time, Part-time", "attributes": {}},
{"title": "**ATTENTION PICKUP OWNERS** Be Your Own Boss", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-14T11:57:30-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-attention-pickup-owners-be/7842318418.html", "description": "Requirements: You must have access to a Pickup Truck with enough space to transport tanks to customers. Responsibilities: Pickup full tanks from local gas retailers to exchange them to our clients empty tanks. FAQ: What kind of deliveries will I be transporting? 20 Lbs - 30 Lbs - 100 Lbs Tanks What kind of GAS is in the tanks? Oxigen, CO2, Propane, He, Nitrogen Approved Driver FLASH-Box Includes: Polo Shirt FLAS GAS Vehicle Gadget Everyone must apply mandatory via or call now 888-FLASH-15 Option 2", "attributes": {}},
{"title": "Home Improvement Sales Position – Seeking MASTER Closers", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-14T12:10:58-0400", "url": "https://rochester.craigslist.org/sls/d/rochester-home-improvement-sales/7842323473.html", "description": "Home Improvement Sales Position – Seeking MASTER Closers $85,000 - $150,000 (Base + Commissions) Long established company seeking motivated “In-Home” representatives. Salary Positions & Commission Only Positions Available. Requirements: -Excellent communicator -“One Call” Closing ability -Construction + Home Improvement knowledge is a plus, not required -Previous home improvement sales is a plus, not required -Financial/consumer lending understanding is a plus, not required. -Technology knowledge. Email, text, pictures, applications, etc. Inclusions: -Paid Training & Expenses -Flexible Hours -Qualified Leads -Set, Vetted, and Confirmed Leads -Bonus Opportunity -Vertical Career Mobility Available -Major Earning Potential -Representatives sell Well-Known Product Lines -No Cold Calling -Retirement Plans Please email this post to discuss the interview process:: OR Visit/apply at our website --- homeownerfunding.org", "attributes": {}},
{"title": "☂️ IMMEDIATE OPENINGS: Nanny, Babysitter, Caregivers - Flexible Hours", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-14T12:40:39-0400", "url": "https://rochester.craigslist.org/edu/d/rochester-immediate-openings-nanny/7842334445.html", "description": "<", "attributes": {}},
{"title": "In-Home Health aid positions available", "compensation": null, "employment_type": null, "location": "Field Street near S. Clinton Avenue", "posted_date": "2025-04-14T12:45:58-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-in-home-health-aid-positions/7842336460.html", "description": "We are looking to hire a home health aid to take care of my elderly mother.  She is wheelchair bound with dementia.  She can stand and pivot with assistance.  Duties include companionship, light house cleaning, meal prep, dressing assitance, bathing, transferring to bed/toilet/chair and driving her to appointments or the store.  Taking care of feeding cat and cat litter.  Most of her days are watching TV and reading the paper. She presents challenges with refusing to take meds, and changing her sanitary pants, so some one with patience would be required. Pay is through the CDPAP program which pays $18/hr with some benefits. Hours available are Sunday 3pm-9pm,", "attributes": {}},
{"title": "In-Home Health aid positions available", "compensation": null, "employment_type": null, "location": "Field Street near S. Clinton Avenue", "posted_date": "2025-04-14T12:45:58-0400", "url": "https://rochester.craigslist.org/hea/d/rochester-in-home-health-aid-positions/7842336462.html", "description": "We are looking to hire a home health aid to take care of my elderly mother.  She is wheelchair bound with dementia.  She can stand and pivot with assistance.  Duties include companionship, light house cleaning, meal prep, dressing assitance, bathing, transferring to bed/toilet/chair and driving her to appointments or the store.  Taking care of feeding cat and cat litter.  Most of her days are watching TV and reading the paper. She presents challenges with refusing to take meds, and changing her sanitary pants, so some one with patience would be required. Pay is through the CDPAP program which pays $18/hr with some benefits. Hours available are Sunday 3pm-9pm, and M-F 1pm - 9pm", "attributes": {}},
{"title": "Lawncare", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-14T13:51:47-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-lawncare/7842359747.html", "description": "Lawncare needed for property management company for 40+ houses in the city for the 2025 season. Please contact us to discuss immediately.", "attributes": {}},
{"title": "Bath  Subcontractors Needed in Rochester, NY", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-14T16:18:05-0400", "url": "https://rochester.craigslist.org/trd/d/west-henrietta-bath-subcontractors/7842407579.html", "description": "Mad City is looking for experienced subcontractors in the Rochester area! Why partner with us? -Earn up to 300k/year -Year round work -Paid Training -Flexible Schedule Requirements -3 years of remodeling, carpentry or construction experience -Knowledge of residential baths and replacement windows -Have an established business or LLC -Have General Liability and Workers Comp Interested in hearing more details about the opportunity? Please call or text Julie at 608-690-3744", "attributes": {}},
{"title": "Cleaning Contractor $25-30", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-14T19:03:33-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-cleaning-contractor-25-30/7842452615.html", "description": "Immediate cleaning appointments available. Looking for reliable Cleaners to clean residentially. Must pass a background check. Call to go over details. *Call/Text 315-620-5431 or Email office@citruscleanco.com", "attributes": {}},
{"title": "Cleaners Needed", "compensation": null, "employment_type": null, "location": "federal dr near Oak Orchard rd", "posted_date": "2025-04-14T20:49:15-0400", "url": "https://rochester.craigslist.org/lab/d/batavia-cleaners-needed/7842475405.html", "description": "I need a cleaner in the Batavia area to clean twice a week on Tuesday and Thursday very simple job will not take long. Clean all year round. Please if you are serious email me with your contact information.", "attributes": {}},
{"title": "JR and more landscaping and general jobs", "compensation": null, "employment_type": null, "location": "240 fyatt street", "posted_date": "2025-04-14T21:59:33-0400", "url": "https://rochester.craigslist.org/lab/d/palmyra-jr-and-more-landscaping-and/7842486882.html", "description": "Offering Landscaping and general jobs , I do jobs like junk removal and helping move furniture but my specialty is landscaping I offer a great price and good service, with 7 years of experience.", "attributes": {}},
{"title": "Line cooks/ prep cook & waitstaff", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T07:45:53-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-line-cooks-prep-cook-waitstaff/7842527786.html", "description": "Highland Diner is looking for experienced line cooks/ prep cooks and servers/ hosts", "attributes": {}},
{"title": "Coutner person Auto shop", "compensation": null, "employment_type": null, "location": "2151 E HENRIETTA RD near Calkins Rd.", "posted_date": "2025-04-15T08:14:40-0400", "url": "https://rochester.craigslist.org/ofc/d/henrietta-coutner-person-auto-shop/7842531107.html", "description": "Counter person for high volume auto shop. Call 585-233-2277 for details.", "attributes": {}},
{"title": "FULL TIME POSITION - USED CAR LOT", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T08:59:31-0400", "url": "https://rochester.craigslist.org/lab/d/spencerport-full-time-position-used-car/7842538196.html", "description": "Looking for someone to oversee sales/daily operations for a small 40-car dealership in Spencerport. Responsibilities include in-person sales, following up on leads, processing financing applications, and coordinating maintenance and repairs. Previous experience in automotive sales or a related field helpful. Proficiency in basic computer skills and a valid driver's license required. To express interest, reply to this email with your resume or qualifications, and contact information.", "attributes": {}},
{"title": "USED CAR SALES", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T08:59:48-0400", "url": "https://rochester.craigslist.org/sls/d/spencerport-used-car-sales/7842538246.html", "description": "Looking for someone to oversee sales/daily operations for a small 40-car dealership in Spencerport. Responsibilities include in-person sales, following up on leads, processing financing applications, and coordinating maintenance and repairs. Previous experience in automotive sales or a related field helpful. Proficiency in basic computer skills and a valid driver's license required. To express interest, reply to this email with your resume or qualifications, and contact information.", "attributes": {}},
{"title": "CDL A Truck Driver - Up to $100k or 70CPM", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T09:52:16-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-cdl-truck-driver-up-to-100k/7842549537.html", "description": "ITN Express is looking for a CDL A Truck Driver to join our team. Join us today and let's work together! Compensation and Benefits: ● Up to 70 CPM (experience-based) ● Performance Bonus ● Weekly Pay ● Home Every Weekend with Regional Runs ● Flexible Routing and Scheduling ● No Touch Freight (load securement only) ● Excellent Customer Service ● 24/7 Dispatch Support Requirements: ● Class A CDL License ● 1 Year Experience Preferred (2 Years Is Even Better) If you have any questions, call us Monday through Saturday 7am-5pm at (413) 271-0111. Thank you and we look forward to working with you! Visit our website for more information or if you have questions! Website: ITNExpress.com **Call/Text: (413) 271-0111 (Karina)", "attributes": {}},
{"title": "AUTO DETAILER, $17 - $20+/HOUR, EXP. PREFERRED, GREAT PLACE TO WORK!", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T10:21:09-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-auto-detailer-hour-exp/7842556537.html", "description": "", "attributes": {}},
{"title": "Window & Door Technician", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T10:39:50-0400", "url": "https://rochester.craigslist.org/trd/d/victor-window-door-technician/7842561473.html", "description": "Do you have 5 years experience with servicing and repairing REPLACEMENT windows and doors? We may have an opportunity for you! We are looking for a full time worker, with reliable transportation and a clean drivers license. Works well with others and is open to overtime hours as needed. Please include resume or contact information when responding. We look forward to hearing from you!", "attributes": {}},
{"title": "Landscape Supervisor position--TOP PAY", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T10:40:41-0400", "url": "https://rochester.craigslist.org/lab/d/webster-landscape-supervisor-position/7842561674.html", "description": "SOME TO MUCH SKILL PROVIDING LANDSCAPING AND LAWN MOWING SERVICES starting with a valid NYS drivers’ license, operational smartphone, vehicle to get to and from or Webster home-base, able to safely drive a tow vehicle/trailer combination, and have no problems working in weather extremes. WELCOME! We are a small, Webster-based, light-landscaping/lawn mowing company who has successfully delivered services to mainly, residential customers, for 30 years. Because we are a smaller operation, all employees are treated as a number, that being #1 :-) AT THIS TIME, we are in need of an experienced individual (Shrub-Trimming/Bed-Edging/Mulch Installation/Weeding/Planting? Spring and Fall Cleanups/Lawn Mowing, MORE) who additionally possesses organizational/problem-solving talent, has successfully taken direction, and either has the necessary experience or looks to assume a first-time working/supervision role with an emphasis on landscaping services, but also having abilities to help out with our mowing operation. PLEASE CHECKOUT OUR WEBSITE, www.jmlsinc.com, to learn if your skills match our needs and how you might contribute while gaining personal satisfaction and making ‘GOOD MONEY.’ If this sounds like a \"fit\" for you, please TEXT Joe @(585) 520-4631 to arrange a prompt meeting with the owner---expect an immediate call back!", "attributes": {}},
{"title": "Animal Lover Wanted", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T13:29:32-0400", "url": "https://rochester.craigslist.org/lab/d/holley-animal-lover-wanted/7842616506.html", "description": "Animal Lover wanted to work in kennel and stable. Experience preferred, but willing to train.  Work includes working with dogs, cat, chickens, guinea foul, horses and goats. Job will include working on holidays. Must be at least 18. Part time or Full time work available.", "attributes": {}},
{"title": "Photographer - Interiors", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T14:02:36-0400", "url": "https://rochester.craigslist.org/med/d/rochester-photographer-interiors/7842628592.html", "description": "We are seeking a talented and reliable part-time photographer to capture high-quality images of our beautifully installed kitchen and bath cabinetry throughout the Greater Rochester area. About the Role: Very part-time; ideal for students, freelancers, or photographers looking for side work Flexible scheduling based on project completion timelines Travel to local homes and job sites to photograph completed cabinet installations Deliver edited, high-resolution images suitable for website, social media, and print marketing What We’re Looking For: Experience photographing interiors, architecture, or products preferred Strong attention to detail, especially in lighting, composition, and staging Ability to edit and deliver professional-quality images on deadline Must have your own DSLR/mirrorless camera and basic lighting equipment Reliable transportation required Why Work With Us: Showcase your work across a variety of media channels Build your portfolio with high-end residential projects Join a creative, growing team passionate about craftsmanship and design To Apply: Please email a resume to this post. Optional Cover Letter Portfolio or 3-5 samples of relevant work Your general availability and hourly rate expectations", "attributes": {}},
{"title": "RN / LPN", "compensation": null, "employment_type": null, "location": "497 Beahan Road near Chili Ave", "posted_date": "2025-04-15T15:01:46-0400", "url": "https://rochester.craigslist.org/hea/d/rochester-rn-lpn/7842646734.html", "description": "Busy pediatric medical practice on the Westside, seeking a full time RN or LPN.  The office accommodates patients 6 days a week, winter hours with some nights till 6PM (limited hours on the weekend, typically 8-12). Approximately 32-40 hours per week. Qualified candidate must have a current NYS nursing license, great communication skills, compassionate, flexible and ability to multi-task. Competitive wages and benefits including 401k. Please send resume.", "attributes": {}},
{"title": "Subcontractors Needed for Residential House Painting", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T15:09:30-0400", "url": "https://rochester.craigslist.org/trd/d/pittsford-subcontractors-needed-for/7842649362.html", "description": "Do you take a lot of pride in your work? Are you sick of working for companies and contractors who are unorganized, unfair, or don’t pay you on time? Do you want to work for a company that will value your work and value you? We are growing fast and have more work than we can handle, and we’re looking for experienced painting contractors to partner with. We understand this is a two way relationship. We provide you with consistent work, fair pay, quick check turnaround times, and a respectful relationship. You provide a great service to our customers and deliver a high quality product with a fast turnaround time. We’re looking for Win-Win, long-lasting relationships with the right people. If that sounds like you and you meet our requirements, we would love to talk with you. Minimum Requirements: Professional and Responsible Contractors Who Have: 1. Strong communication skills 2. A Registered Business 3. General Liability Insurance 4. All Tools & Equipment 5. Workers Comp Policy Please do not respond if you don’t meet these minimum requirements. Contact Max at 585-565-5279 or email us max@batesbrotherspainting.com.", "attributes": {}},
{"title": "Stop What You're Doing. It's Not Working. Start Selling $2 Car Leads!!", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T15:14:23-0400", "url": "https://rochester.craigslist.org/sls/d/rochester-stop-what-youre-doing-its-not/7842650981.html", "description": "You’ve probably seen this ad before. Why? Because it works. So, what are you waiting for? We host informative Q&A sessions on Zoom every Monday and Thursday at 9 AM (PST). This is your chance to see exactly how this works, ask questions, hear from past trainees, and decide if it's right for you. It costs you nothing to find out more! You can reserve your spot now using the following link: Comprehensive Training—Get Started Immediately! No experience, no problem. This isn’t just a training—it’s a proven turnkey system that shows you how to create your own business generating car leads and start making money immediately by selling them to dealers nationwide online. Our program is designed to give you everything you need to succeed at this, right away. You don't have to be a rocket scientist and you don't need a Harvard degree. Take the bat off your shoulders and take a swing. Get out of your comfort zone, and try something totally different. Start selling car leads from home. You can even do it in your pajamas! So, What’s the Deal? We’ve cracked the code on tapping into online leads—people actively searching for cars, trucks, or SUVs within the last 48 hours. These leads aren’t random. These individuals have at least $4,000 for a down payment and live within 15-20 miles of the dealership. Best of all, you’ll have their name and phone number right at your fingertips. You can generate a remarkable 200-250 leads daily. Anything above that and you will need to consider bringing on an assistant to keep up the pace. Why This Works: Car dealers need fresh leads and that's why you’ll start by giving them 200 for free to prove their value. Even if a dealer converts just 3 of those leads into sales, they’ll be calling you for more. Why? Because each car deal brings in around $3,000 in profits, warranties, and financing. This is a no-brainer for them. How much can you make without killing yourself? Realistically, you could make over $7k to $8k in your very first month. That's just the starting point, it's possible to make $10k, $15k, $20k plus in short order. Work harder, make more money. Take your foot off the gas pedal and make less money. If you hate your current job, call or text us at +1 760-846-5665. If you're underpaid, call or text us at +1 760-846-5665. If your fridge only has pickle juice and mayonnaise in it, call or text us at +1 760-846-5665. If you wake up in the morning and all you think about is all those bills that you have not opened up, call or text us at +1 760-846-5665. If you're still not sure, pick up your phone and call or text us now at +1 760-846-5665. Ready to Get Started? Contact us by call, text, email, or through our website: You can check out our video on YouTube \"Sell $2 Auto Leads Like Hotcakes!!!\" using the following link: Here are some YouTube videos included in our training for you to check out as well: Magic Leads Training Simple Setup for Success Making Contact with Dealers These Dealers Buy Leads Dr. B's Optional Method 2 Dr. B's Optional Method 3 Dr. B's Optional Method 4", "attributes": {}},
{"title": "Lawn maintenance and Landscape positions", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T15:55:19-0400", "url": "https://rochester.craigslist.org/lab/d/spencerport-lawn-maintenance-and/7842662900.html", "description": "Well established company that specializes in commercial landscape property  maintenance and landscape installation is  looking for ambitious individuals to be a part of our upcoming lawn  maintenance and landscaping crews.We have a comfortable work environment that offers  401(k) monthly evaluations for pay increases.Year  round Work available.We have many positions from mulching, plant installation, line trimming, shrub trimming, and mowing crews. experience preferred but not necessary will train.Monday through Friday  8am-5pmNo texts.Call 585-732-1685", "attributes": {}},
{"title": "Bank Branch Cleaner Perry", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T17:01:52-0400", "url": "https://rochester.craigslist.org/lab/d/perry-bank-branch-cleaner-perry/7842683073.html", "description": "Looking for a p/t bank branch cleaners in the Perry andNunda areas. Monday-Friday 1.5 | 7.5 hours a week | $16.00 an hour | biweekly pay *Starting time is one hour after location closes. M-TH after 5pm Friday after 6pm Please call (716)862-0465 to schedule an interview or email info@questwny.com", "attributes": {}},
{"title": "kitchen help", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T18:19:57-0400", "url": "https://rochester.craigslist.org/fbh/d/webster-kitchen-help/7842703937.html", "description": "LA BELLA VITA IS LOOKING FOR EXPERIENCED PIZZA MAKERS", "attributes": {}},
{"title": "DELIVERY DRIVER-MONROE COUNTY", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-15T19:33:08-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-delivery-driver-monroe-county/7842720457.html", "description": "LOOKING TO HIRE A PART TIME DELIVERY DRIVER. ALL DELIVERIES ARE MADE WITHIN THE MONROE COUNTY AREA. -MUST BE FAMILIAR WITH THE ROCHESTE AREA. -MUST HAVE A DEPENDABLE CAR AND A VALID DRIVERS LICENSE. -AFTERNOON HOURS 12:30 PM- 3:30 PM.  MONDAY, WEDNESDAY AND FRIDAY. -MUST BE ABLE TO LIFT 20 POUNDS. -WAGES WILL INCLUDE HOURLY + MILEAGE. -SERIOUS INQUIRES ONLY PLEASE. -LOOKING TO FILL POSITION RIGHT AWAY. PLEASE SEND PHONE NUMBER AND RESUME TO: ONTHEGONOTARY123@YAHOO.COM", "attributes": {}},
{"title": "Tow Truck Operator", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T06:48:20-0400", "url": "https://rochester.craigslist.org/trp/d/macedon-tow-truck-operator/7842782308.html", "description": "Tow Truck Driver needed. Must have towing endorsement and clean license. Must be able to work some nights and weekends. Experience helpful but will train the right person. 40 hrs plus overtime available. nights weekends commission based. Also helps to live near the shop to take a truck home. Call Today 585-370-3441", "attributes": {}},
{"title": "Retail Sales Associate - Immediate Recruitment", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T07:10:57-0400", "url": "https://rochester.craigslist.org/ret/d/rochester-retail-sales-associate/7842784045.html", "description": "", "attributes": {}},
{"title": "💲🚚 SAME DAY PAY & FREE TRAILER    CDL OWNER OPERATOR 🚚💲", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T09:03:53-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-same-day-pay-free-trailer-cdl/7842798277.html", "description": "", "attributes": {}},
{"title": "COMMERCIAL ELECTRICIANS", "compensation": null, "employment_type": null, "location": "599 PHILLIPS RD", "posted_date": "2025-04-16T09:28:31-0400", "url": "https://rochester.craigslist.org/trd/d/webster-commercial-electricians/7842803111.html", "description": "Commercial Electricians wanted for full-time position with Top 100 company. Candidate should possess ability to work individually or with a team efficiently and safely. Must be self-motivated, organized and able to prioritize tasks with professional appearance and positive attitude. Transportation and tools required. Experience preferred.", "attributes": {}},
{"title": "RESIDENTIAL ELECTRICIAN", "compensation": null, "employment_type": null, "location": "599 PHILLIPS RD", "posted_date": "2025-04-16T09:29:41-0400", "url": "https://rochester.craigslist.org/trd/d/webster-residential-electrician/7842803340.html", "description": "RESIDENTIAL ELECTRICIAN WANTED FOR FULL-TIME POSITION WITH TOP 100 ELECTRICAL COMPANY. CANDIATE SHOULD BE DEPENDABLE WITH A POSITIVE ATTITUDE.  DUTIES INCLUDE  INSTALLS, REPAIRS AND UPDATING RESIDENTIAL ELECTRICAL SYSTEMS INCLUDING BUT NOT LIMITED TO LIGHT FIXTURES, WIRING, RECEPTACLES, AND PANEL BOXES. EXCELLENT POTENTIAL TO ADVANCE WITH COMPANY. MUST HAVE TRANSPORTATION.", "attributes": {}},
{"title": "Cleaner Needed", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T09:36:14-0400", "url": "https://rochester.craigslist.org/lab/d/henrietta-cleaner-needed/7842804746.html", "description": "Looking to fill a full time - 40 hr position in the Henrietta area $17.70/hr to start - Raise after 30 days Monday through Friday 5pm to 1:30 am Paid holidays, vacation and sick time Additional benefits available Seeking reliable person Experience is a benefit but not a necessity Please call John at 585-642-1766 and leave contact information Texts will not be viewed", "attributes": {}},
{"title": "Carpenters Helper and Painter", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T09:56:13-0400", "url": "https://rochester.craigslist.org/lab/d/brockport-carpenters-helper-and-painter/7842809332.html", "description": "We are hiring for a carpenters' helper/painter. MUST HAVE OWN transportation. Most jobs are from Webster to Medina. Must be able to read a tape measure. Pay based on experience.", "attributes": {}},
{"title": "Flooring Installers // Laminate, LVP, Hardwood, Tile.", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T09:56:56-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-flooring-installers-laminate/7842809507.html", "description": "Flooring installation company is searching for talented and experienced flooring installation subcontractors. Immediate work available. We do not train Flooring installers or provide tools, you must be a vetted flooring contractor, ready to work. We are looking for Hardsurface crews and Tile crews. Residential only. Local Offices / Weekly Direct Deposit / Year-Round Work. -Must have 3 to 5 years of experience in Flooring only, or longer. -Pass a Criminal background check. -Have reliable transportation. / work Cargo van, preferably, Truck, or trailer. -All trade tools to install flooring according to the manufacturer's specs and guidelines. Text 512-423-8923 When you text, let me know your name, zip code, what you install, years of experience, and what kind of work you are doing now. Tell me a little about what you do. I will text or call you back.", "attributes": {}},
{"title": "Delivery's Needed. Transportation.US DOT.", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T10:13:21-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-deliverys-needed/7842813751.html", "description": "FLOORING DELIVERED TO RESIDENTIAL HOMES. PAID PER DELIVERY. YEAR-ROUND WORK. WEEKLY DIRECT DEPOSIT. 1099. WHITE GLOVE DELIVERY. MUST HAVE CARGO AND COMMERCIAL GENERAL LIABILITY. TEXT ME \"BUFFALO DELIVERY\" AND I WILL CALL YOU BACK. 512-423-8923..", "attributes": {}},
{"title": "CDL Dump truck/ Lowboy Driver", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T10:13:55-0400", "url": "https://rochester.craigslist.org/trp/d/fairport-cdl-dump-truck-lowboy-driver/7842813918.html", "description": "Full Time Year Round Steady work Overtime pay Currently hiring Tri Axle dump truck and Lowboy drivers. Must have a clean CDL AND 5 years experience in CONSTRUCTION driving. Must have knowledge of local plants and quarries. Must have transportation to our shop in Fairport . Call, stop in or apply online. 585-223-266zero.   300 Hogan Rd, Fairport Monroeroadways.com Benefits include 401k, health and dental.", "attributes": {}},
{"title": "Sirness Vending is hiring!  Route Driver position available", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T10:44:22-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-sirness-vending-is-hiring/7842821924.html", "description": "Sirness Vending Services is hiring! Currently is accepting applications for route drivers.  Full time early hours, Monday – Friday days, $45,000-$60,000, benefits offered, paid holidays Sirness Vending Services has been locally owned and operated for nearly fifty years servicing Central and Western New York.  Headquartered in Gates, we pride ourselves on providing great customer service and a positive quality work environment for our staff. Applicants must have strong customer service skills, clean driver’s license, a good work ethic and attitude. Route drivers: early flexible hours, drive company provided sprinter van to established customer locations, stock/service vending machines and self-checkout market, maintain inventory, check in with customer location points of contact.  Must be able to frequently lift 40lbs, must have great customer service We strive to have a positive working environment with a team approach.  We are looking for people with good attitudes and work ethics.  We take an approach of we are all in this together.  We want to work with good people! Qualified applicants should apply at Sirness.com Thank you for considering Sirness Vending Services for your career!", "attributes": {}},
{"title": "Part time line cook", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T10:57:11-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-part-time-line-cook/7842825233.html", "description": "We are seeking a part time line cook for approximately 25-30 hours a week. We have a fun atmosphere and are looking for a dedicated person to join our team!", "attributes": {}},
{"title": "Gutter Cleaners Needed - $20-$25/hr - $500 Sign-On Bonus!", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T10:57:30-0400", "url": "https://rochester.craigslist.org/lab/d/fairport-gutter-cleaners-needed-hr-sign/7842825340.html", "description": "We are seeking Gutter Cleaners to maintain and clear gutters for residential and commercial properties. Applicants MUST be proficient at going up and handling ladders, placing ladders, and WALKING ON ROOFS (Please do not contact us if you are not comfortable walking on roofs!). **Must be prepared to work through difficult weather.** We are looking for candidates who are able to start immediately! Minimum Requirements to Apply: - Valid NYS Driver's License - Reliable transportation to Fairport each day - Prior roof experience or willingness to walk on roofs (**NEEDED**) - Open to background checks and drug testing. Compensation: $20-$25/hour depending on experience. $500 Sign-On Bonus!! Please fill out our Application here: OR: Call/Text Penny at phone: 585-703-7698.", "attributes": {}},
{"title": "Siding/Window Installer", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T11:17:27-0400", "url": "https://rochester.craigslist.org/trd/d/fairport-siding-window-installer/7842831787.html", "description": "Seeking experienced siding and window/door installer. Must have truck, tools, insurance. Looking for long-term relationship. Competitive compensation. Prompt payment.", "attributes": {}},
{"title": "Professional NEMT/Medicaid Drivers - $18 Start", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T05:21:03-0400", "url": "https://rochester.craigslist.org/trp/d/east-rochester-professional-nemt/7842778079.html", "description": "We are busy and we are growing! Are you looking for steady employment? 40 hours per week. M-F. Must not have any afternoon commitments such as have to get child off school bus, second job, and etc. Hours range, but generally your working hours will be somewhere in between 7 AM and 5 PM.   M-F Must be reliable and professional. Clean license and people friendly. We are known for our awesome drivers. Pay starts @ $18.00 Per Hour - Raises are possible after 90 days. Get paid weekly through ADP payroll. Use our vehicles and our gas. Must have reliable transportation to get to our office in East Rochester. No Bus or Uber. We are  strict about punctuality. We do not employ people that are late or call in excessively. Please don't waste both of our times. Email a little about yourself and any experience you may have and we'll set up an interview.", "attributes": {}},
{"title": "Seasonal Lifeguard Needed", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T12:34:11-0400", "url": "https://rochester.craigslist.org/etc/d/rochester-seasonal-lifeguard-needed/7842857401.html", "description": "Lifeguards Needed! Very Competitive Pay! D&C Rochester's Choice Best Apartment Management Company! Have fun in the sun and get paid $20.00 per hour + bonus!! We own and manage 10 of the finest apartment communities in the Rochester area. We are seeking individuals to join our lifeguard team who want to work hard and make a positive contribution to our apartment communities. Our season runs from Memorial Day weekend through Labor Day. Weekend availability a must. Multiple Locations! Job details: 35+ hours/week - on a rotation (weather permitting) Must be available to work weekends Job requirements: Must be at least 18 years of age Must have reliable transportation Life Guard Certification and CPR: MUST BE UP TO DATE Friendly demeanor Team player Please send resume with your phone number when responding. *Bonus incentive at the end of season if all requirements are met* Job Types: Full-time, Part-time Pay: $20.00 per hour Schedule: 8 hour+ shift Day and Evening shifts Holidays Overtime Weekend availability Bonus pay Education: High school or equivalent (Required) Experience: Lifeguard: 1 year (Preferred) Customer Service: 1 year (Preferred) License/Certification: First Aid Certification (Required) Lifeguard Training (Required) Work Location: Multiple Locations Hiring For 1600 Elmwood Avenue , Contact Missy at 1600Elmwood@tricityrentals.com or call (585)488-4982 For French Court, Contact Tracy at French@tricityrentals.com or call (585)577-4808 For Rustic Village, Contact Chris at Ctoomey@tricityrentals.com or call (585)424-4380 For The Meadows, Contact Brittany at Meadows@tricityrentals.com or call (585)656-2661 For Spanish Gardens, Contact Brandon at Spanish@tricityrentals.com or call (585)577-7034 For Woodgate Place, Contact Sue at Woodgate@tricityrentals.com or call (585)547-5579", "attributes": {}},
{"title": "🔴🔴 JOIN OUR PAID MARKET RESEARCH PANEL 🔴🔴", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T17:25:45-0400", "url": "https://rochester.craigslist.org/etc/d/newtown-square-join-our-paid-market/7842948423.html", "description": "JOIN OUR PAID MARKET RESEARCH PANEL ! ⏩Be paid for sharing your views – From air fresheners to pancakes, ice cream, medical ailments and many other exciting products and services, we're eager to involve you! ⏩Online surveys, product taste tests, focus groups, at home product testing. ⏩It's easy and FREE to register for our National Panel. Click the below link and we will contact you for future paid studies. Research America, Inc. www.researchamericainc.com Spread the Word - Click, Post, Share with Your Friends From Across the Nation ! #paidresearch #consumerresearch #researchpanel #paidsurveys #surveys #focusgroups #producttesting", "attributes": {}},
{"title": "Work From Home $$ Make $1,000 this Month", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-16T18:06:42-0400", "url": "https://rochester.craigslist.org/sls/d/west-henrietta-work-from-home-make-1000/7842960206.html", "description": "Explore income opportunities with a well known Wellness company. Great Pay. Make your own hours. Work at your own pace. No monthly quotas INCOME UNLIMITED BASED ON YOUR GOALS. INTERESTED??  EMAIL FOR ZOOM INFORMATION.  OR CALL 310-213-8542", "attributes": {}},
{"title": "Pizza Makers, Shift Runners, Driver's + More!", "compensation": null, "employment_type": null, "location": "1219 Lyell Ave.", "posted_date": "2025-04-16T19:37:06-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-pizza-makers-shift-runners/7842980718.html", "description": "Looking for qualified Pizza Makers, shift runners, counter help, food prep and delivery drivers! Will train from the ground up but experience preferred! Must be able to take calls, be on time, move with purpose (we get busy!) and have a good time! Part time and full-time available. Stop in for more information! 1219 Lyell ave. Rochester Ny 14606 long standing, successful neighborhood pizzeria! Join our team today!", "attributes": {}},
{"title": "CONSTRUCTION CARPENTERS - HOME REMODELING", "compensation": null, "employment_type": null, "location": "1380 Scottsville Rd", "posted_date": "2025-04-17T09:48:30-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-construction-carpenters-home/7843064453.html", "description": "ATTENTION CARPENTERS!! If you’ve worked for one of the many home improvement companies in the area, YOUR EXPERIENCE MAY BE JUST WHAT WE NEED! Many installers who have been unappreciated working for these companies, have now found GREAT CAREERS with TEAM COMFORT! A CAREER with COMFORT includes: \tFull-time, year-round positions! \tStarting pay rates that are some of the best in the industry! \tAnnual pay increases! \tAffordable options in health, dental, and vision plans! \tFree $10,000 life insurance policy! \t401K plan with a dollar-for-dollar company match up to 4%! \tGenerous number of paid days off for holidays, vacation, and sick time! \tPromotions from within for great career advancements! DON'T WAIT...APPLY NOW! Send your Full name, Phone number, and brief description of your experience. (include a copy of your resume if you have one) As we have a wide variety of positions, our starting pay ranges between $18 - $28/hr. and encompasses all skills and experience levels. Specific pay rates will be decided upon completion of the interview process and determination of job level to be offered. Comfort Windows is proud to be an equal opportunity employer. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, gender identity or expression, sexual orientation, national origin, genetics, disability, age, or veteran status.", "attributes": {}},
{"title": "Painters wanted", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-17T09:58:28-0400", "url": "https://rochester.craigslist.org/lab/d/webster-painters-wanted/7843066767.html", "description": "Looking for a self motivated exterior painter with experience AND TRANSPORTATION. Call or text for a phone interview. Work is available immediately", "attributes": {}},
{"title": "Professional Vinyl Siding Sub-contractors needed asap!", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-17T10:35:14-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-professional-vinyl-siding-sub/7843076504.html", "description": "WANT STEADY WORK THROUGHOUT THE YEAR? JOBS READY TO BE INSTALLED RIGHT NOW! Large local home improvement company has an immediate need to hire professional sub-contractors for residential siding projects in ROCHESTER and surrounding areas. Siding labor rates will be discussed in more detail via phone or in-person interview. VINYL SIDING - paid per sq. - COMPETITIVE RATES Additional labor for the following: * Vinyl or Aluminum tear-off * Aluminum capping for windows and doors * Soffit and Fascia * Garbage removal ****MUST HAVE LIABILITY INSURANCE **** - Prices are labor only. Our company is responsible for 100% of all materials --------------------------------------------------------------------------------------------- Crews must be fully licensed and insured, highly experienced, dependable, and provide superb workmanship. Must be willing to do some travel as needed (up to approx 60-90 minutes) with own truck, tools and equipment. Year round work and competitive pay. Get paid quickly.. Please reply to this email with contact information for immediate consideration. We have jobs ready to be installed right now!!", "attributes": {}},
{"title": "Inside Sales Representative (665)", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-17T10:59:36-0400", "url": "https://rochester.craigslist.org/sls/d/shortsville-inside-sales-representative/7843082702.html", "description": "", "attributes": {}},
{"title": "Flexible Dishwasher", "compensation": null, "employment_type": null, "location": "1 E Church St, Fairport, NY 14450 near MAIN ST", "posted_date": "2025-04-17T13:13:08-0400", "url": "https://rochester.craigslist.org/fbh/d/fairport-flexible-dishwasher/7843126541.html", "description": "Hi- We are looking for a dishwasher to fill in evenings as needed and weekends. Saturday and Sunday would generally be a day shift but could be night as well depending on what events we have. Some experience would be good, but we can train you. Please let me know the best way to reach you. This is a great part time second job.", "attributes": {}},
{"title": "Diner Cook $26+! we want the best", "compensation": null, "employment_type": null, "location": "2171 W Henrietta Rd", "posted_date": "2025-04-17T14:31:14-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-diner-cook-26-we-want-the-best/7843152820.html", "description": "IF YOU HAVE NEVER WORKED IN A DINER BEFORE DO NOT APPLY Tired of not being paid what you're worth? We want the best of the best MUST HAVE DINER EXPERIENCE. Cook with management skills a bonus needed breakfast and lunch hours now, 1 job position open looking for a dependable person,  if that’s you call or text 585 764 8204 must be drug free, ego free. Paid what you're worth CALL FOR DETAILS WE ARE IN BRIGHTON NY 14623 if this is still up we’re still looking", "attributes": {}},
{"title": "Entry Level Mechanic", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-17T15:10:15-0400", "url": "https://rochester.craigslist.org/trd/d/webster-entry-level-mechanic/7843165673.html", "description": "Rochester based utility company looking for an entry level mechanic for our vehicles and equipment.  Required to perform basic maintenance on heavy equipment and vehicles such as oil changes, tire rotations and other preventative maintenance as needed.  Other duties will include keeping the vehicles clean, and keeping a clean and safe work environment. Requirements: •\tValid NYS driver’s license •\tReliable transportation •\tPass standard drug test •\tOwn tools •\tUse of power and hand-held tools We offer: •\t401K with company match •\tHoliday pay •\tPersonal/vacation time •\tSafety and Attendance incentive •\tHealth Insurance •\tDental Insurance •\tYear-round work •\tNewer equipment Provide resume if available", "attributes": {}},
{"title": "Dump Truck Driver", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-17T17:18:27-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-dump-truck-driver/7843202714.html", "description": "Class A or Class B to transport asphalt or aggregate to job site Airbrake endorsement and clean license mandatory. Familiarity with Rochester-area asphalt plants and their operations a plus Assist construction crews while waiting to unload Able to work in a team environment and follow directions of manager as to daily tasks and expectations for each specific project or job site Ability to read maps and navigate to new locations Perform other duties as assigned pay is determined on experience call 585-746-1899", "attributes": {}},
{"title": "Looking for someone to be Buddy the Steer", "compensation": null, "employment_type": null, "location": "2199 east Henrietta rd", "posted_date": "2025-04-17T20:13:13-0400", "url": "https://rochester.craigslist.org/sls/d/rochester-looking-for-someone-to-be/7843243277.html", "description": "We are looking for one or two people are energetic and can stand for long periods of time while grabbing customers attention. Be creative", "attributes": {}},
{"title": "***CREATE YOUR FUTURE HERE ** CALL TODAY***", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-18T09:19:50-0400", "url": "https://rochester.craigslist.org/acc/d/rochester-create-your-future-here-call/7843314636.html", "description": "We offer the flexibility to work from anywhere while helping families take control of their financial future. Through training and mentorship, we will help you gain financial knowledge and leadership skills while working towards your goals.  Our company has more 5 and 6-figure earners than any other company in America. Your future starts with what you learn today. Message me or call 941-350-5437 to schedule a 30-minute zoom meeting to learn more. Laura", "attributes": {}},
{"title": "Movers wanted", "compensation": null, "employment_type": null, "location": "Bay Rd near Empire", "posted_date": "2025-04-18T09:30:03-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-movers-wanted/7843316530.html", "description": "LOOKING FOR 5 STRONG, STABLE, INDEPENDENT, RELIABLE PEOPLE LOOKING TO BUILD A CAREER IN THE MOVING BUSINESS. MUST BE ABLE TO PASS A BACK GROUND CHECK AND A DRUG TEST. MUST HAVE OWN VEHICLE TO GET TO WORK. A WORKING CELL PHONE AT ALL TIMES. MUST HAVE VALID DRIVERS LICENSE WITH NO DUI DRUG OR ALCOHOL RELATED. LOOKING FOR SOMEONE WHO DOES NOT WANT TO WORK FOR SOMEONE BUT WORK TO BUILD THE COMPANY SO THEY CAN BUY IT OUT IN 3-5 YEARS. THIS POSITION STARTS OUT AT $18/HR PLUS TIPS. MUST BE ABLE TO CARRY HEAVY FURNITURE SAFELY UP AND DOWN STAIRS.MUST BE PHYSICALLY FIT TO DO 5-6 HOUR MOVES AT A TIME AT FACE PAST! IF YOU PROVE YOURSELF YOU WILL MAKE MORE.", "attributes": {}},
{"title": "FENCE BUILDERS & LABORERS NEEDED", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-18T09:56:43-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-fence-builders-laborers-needed/7843322584.html", "description": "🔨 SKILLED FENCE & DECK BUILDERS WANTED 🔨 💰 EARN UP TO $700 WEEKLY - NO RESUME NEEDED! 💰 ⚡ IMMEDIATE OPENINGS - GET PAID WEEKLY OR DAILY! ⚡ Are you good with your hands and looking for steady outdoor work with a straightforward team? Join our growing fencing company and start earning immediately! WHY WORK WITH US: 💵 Competitive pay: $18-22/hour based on experience 🗓️ Flexible payment options: Get paid weekly OR daily - your choice! 👍 Simple hiring process: No resume required, just one interview 🕗 Consistent hours*: 8am-4pm, Monday-Friday with a full hour lunch break We provide all the tools you need - just bring your skills and work ethic! REQUIREMENTS: 🔹Must be 18 or older 🔹Valid driver's license 🔹Must have reliable transportation to job sites 🔹Experience with fence or deck building preferred but willing to train the right candidate 🔹Ability to work outdoors in various weather conditions THE WORK: 🔹Building quality fences and decks for residential and commercial clients 🔹Physical but rewarding outdoor work 🔹Friendly, easy-going work environment with straightforward expectations 🔹Fully insured company APPLY TODAY: Don't miss this opportunity to join our team! No complicated application process - just one interview to get started. Call/Text: (585) 649-6017 *Work availability depends on weather conditions and project schedule. Up to $700 weekly earning potential.", "attributes": {}},
{"title": "Heavy duty Diesel truck & 53ft trailer Mechanic PART TIME or FULL TIME", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-18T10:11:16-0400", "url": "https://rochester.craigslist.org/trp/d/brockport-heavy-duty-diesel-truck-53ft/7843326399.html", "description": "*u\n*Clean, temperature-controlled work environment.\n. $28-$35 per Hr Depending on qualification Call John 731 345 9860 Apply", "attributes": {}},
{"title": "💰  Secure Your Retirement—Work Smarter, Not Harder  💰", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-18T10:43:48-0400", "url": "https://rochester.craigslist.org/sls/d/rochester-secure-your-retirementwork/7843335021.html", "description": "Here are 3 ways to build a in 5 years: 1.  If you can earn 12% per year (like in a mutual fund), you will need to save to reach $1MM in 5 years. 2.  Increasing your returns (by investing in risky financial vehicles, like crypto) can certainly help, but not as much as you might think.  Even if you could earn 36% per year, you would still have to save . 3.  There is a better way.  And you don't have to risk any of your own money in the market. Watch our 4-minute intro video by Then watch our 18-minute \"solution video\" right after (you have to enter good contact info on the 1st video page, or you won't be able to see the 2nd video) Make sure to pay attention to the part in the 2nd video about (this is incredible) You have never seen anything like this.", "attributes": {}},
{"title": "Heavy duty Diesel truck & 53ft trailer Mechanic PART TIME", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-18T10:58:44-0400", "url": "https://rochester.craigslist.org/trp/d/brockport-heavy-duty-diesel-truck-53ft/7843339236.html", "description": "*u\n*Clean, temperature-controlled work environment.\n. $28-$35 per Hr Depending on qualification Call John 731 345 9860 Apply", "attributes": {}},
{"title": "CDL class B driver", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-18T12:28:57-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-cdl-class-driver/7843368145.html", "description": "- Seeking Class B driver for local straight truck work.  Mostly within Monroe county. Monday-Friday, 7:30-4pm. 35-40 hours/week. -Preference given to candidate with Haz Mat endorsement. -Complete Daily pre and post trips. -Please submit resume", "attributes": {}},
{"title": "Restaurant Delivery", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-18T13:00:14-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-restaurant-delivery/7843379631.html", "description": "", "attributes": {}},
{"title": "Prep Cooking Dishwasher", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-18T14:45:24-0400", "url": "https://rochester.craigslist.org/fbh/d/fairport-prep-cooking-dishwasher/7843415571.html", "description": "Looking for part time/ full time prep cooking and dishwasher in upscale restaurant in Fairport.", "attributes": {}},
{"title": "Weekly summer flower care", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-18T14:58:57-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-weekly-summer-flower-care/7843420115.html", "description": "Weekly weeding, watering and fertilizing of annual flowers and vegetable garden.  Two (2) days a week.  Four (4) hours per day.  Please send brief work history and reason why this job fits your schedule.", "attributes": {}},
{"title": "Property Preservation Vendor", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-18T15:03:25-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-property-preservation-vendor/7843421683.html", "description": "Are you capable of completing all facets of Property Preservation? We are recruiting for Monroe, Orleans, Genesee, and Wyoming counties. This would include, but not be limited to; - Initial Securing - Recurring Landscape/Yard Maintenance - Snow Removal - Window/Door Repairs/Replacements - Roofing and Siding Repairs/Replacements - Winterizations - Debris Removal - Remediation Must have: - Smart phone and computer - Equipment/tools to effectively complete the work - Required State Licenses (when applicable) - Required Insurances: General Liability, E&O, Workers Compensation - Able to submit and pass an Aspen Grove Background Check (we will process if you do not have) *** MUST HAVE OR BE WILLING TO ATTAIN EIN NUMBER AND REGISTER AS EITHER AN S-CORP OR C-CORP! IF YOU ARE UNABLE OR UNWILLING, YOU WILL BE DISQUALIFIED FROM THIS POSITION!*** Payments are made through Direct Deposit. We pay out weekly for all orders completed and made Ready for Office within that pay week. Work must be completed by the provided (reasonable) due dates. Photos are required for each property and work order. Check out our website: bginspect.com TO APPLY, email us your... Name (first and last), phone number, email address, and ZIPCODE to recruiting@bginspect.com We will email you back within 24 hours. THANK YOU FOR YOUR TIME!", "attributes": {}},
{"title": "Business Office Cleaning", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-18T15:08:52-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-business-office-cleaning/7843423731.html", "description": "Two (2) times a month at night or on a Saturday or Sunday. Approximately 2,000 sq ft open style office space. Expectations: Vacuum all carpets Dust and/or clean all furniture and surfaces Maintain wood floor areas Clean breakroom Remove garbage and recycling, when necessary Please send work history and will need references.", "attributes": {}},
{"title": "Cleaner/Turnover Prep-- PT", "compensation": null, "employment_type": null, "location": "268 Sanford near South", "posted_date": "2025-04-18T15:18:01-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-cleaner-turnover-prep-pt/7843426810.html", "description": "Looking to hire a reliable CLEANER--- (20 hrs/week average) **Cleaning experience preferred and reliable vehicle and driver license required **We are looking for someone available to clean apartment common areas and vacant apartments at turn-over. **Flexible Hours **Applicants Should have availability on the last day of Every month (regardless of the day of the week). We have some weekend/holiday turnovers (Sat & Sun), depending on when the last day of the month falls. If interested, please respond with a resume, or provide a brief work history, including references. Thank you for your time", "attributes": {}},
{"title": "Cleaners Wanted", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-18T17:32:37-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-cleaners-wanted/7843466650.html", "description": "C&D Property Maintenance is a small cleaning business providing services in the areas surrounding Rochester. We are looking to expand our cleaning crew with someone who is eager to learn. This job is starting at an hourly pay of $15.00. Please read below for a full work description before applying. What this job looks like… -This is a part time position (On average, 25-30 hours a week). -Though it is part time, we work every day M-F. -Our work day starts on average 9am, and ends roughly around 3:00pm. This is the average time frame for the day, but it does vary from day to day. -We carpool from job to job, and you will leave your car at a designated meeting place. We ask that you have reliable transportation to show up to the meeting place on time; whether it be your own transportation, a ride into work, or public transportation. Within this job expect to… -Clean residential houses and new construction homes. -Vacuum, dust, mop, make beds, clean kitchens and bathrooms, etc. In our employees we look for… -Hard workers -Workers ready to learn and try new things -Workers that are reliable -Workers that come in energetic and ready to go", "attributes": {}},
{"title": "Barn Job", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-18T17:44:04-0400", "url": "https://rochester.craigslist.org/lab/d/lyons-barn-job/7843469766.html", "description": "Barn help needed!! Located in Lyons ny! Monday-Fridays starting at 7:30am. Takes about 4 hours give or take. You would feed, turn out, muck stalls, fill water buckets, etc. Horse experience is a must!!", "attributes": {}},
{"title": "Short Order Cook", "compensation": null, "employment_type": null, "location": "12 Courtney Drive", "posted_date": "2025-04-19T01:08:24-0400", "url": "https://rochester.craigslist.org/fbh/d/fairport-short-order-cook/7843540721.html", "description": "-experienced cook -knows how to work in busy environment -late nights -good pay -looking to start asap! Call or text (585) 738-4747 for interview!", "attributes": {}},
{"title": "Summer Horse Farm Help Wanted", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-19T13:30:12-0400", "url": "https://rochester.craigslist.org/lab/d/fairport-summer-horse-farm-help-wanted/7843640940.html", "description": "We are a private show farm looking to help us with the daily care of the horses. Mucking stalls, grooming horses, turn-out, bathing, etc. Experience is great however, not necessary! Summer part time hours available. One weekend day a week required the rest is flexibele. We are willing to train the right person. So, if you are energetic and hardworking please reach out. We are located in the Penfield-Fairport area Part-time positions are available for the  Summer. Full day hours are 7am - 4pm. Half days are available as well 7am - 11am. Must be able to lift 50 lbs.  hay bales, grain bags Must have your own transportation! and valid drivers license. Very Competitive Pay! Please call or text (585) 230-6904. We look forward to hearing from you!", "attributes": {}},
{"title": "Hiring Machine Operators! No Exp Req, $22/hr", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-19T17:00:31-0400", "url": "https://rochester.craigslist.org/mnu/d/albion-hiring-machine-operators-no-exp/7843699711.html", "description": "", "attributes": {}},
{"title": "COOKS/KITCHEN STAFF", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-19T17:35:23-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-cooks-kitchen-staff/7843707838.html", "description": "Comedy @ The Carlson Please reply with resume if interested", "attributes": {}},
{"title": "Private Investigator", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-19T21:18:56-0400", "url": "https://rochester.craigslist.org/etc/d/livonia-private-investigator/7843749523.html", "description": "Suspicious of a loved one; Is your employee actually sick? I supply a confidential and reliable service, that doesn’t supersede any legal boundaries. I will do what it takes to give you the answers you seek, but am limited by legal boundaries. I cannot and will not enter someone's home, office, or property without explicit permission from the owner, as well as Wiretapping and Recording: (Private investigators cannot intercept phone calls or electronic communications without consent.)", "attributes": {}},
{"title": "Delivery Driver - No Experience Needed - Start Delivering Today", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-20T09:01:15-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-delivery-driver-no-experience/7843795209.html", "description": "", "attributes": {}},
{"title": "* Deliver with DoorDash *", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-20T10:00:06-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-deliver-with-doordash/7843803605.html", "description": "", "attributes": {}},
{"title": "Delivery Driver - Start Delivering Today", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-20T12:00:06-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-delivery-driver-start/7843824485.html", "description": "", "attributes": {}},
{"title": "PROFESSIONAL PAINTERS ONLY", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-20T12:19:58-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-professional-painters-only/7843828897.html", "description": "Searching for full time professional painters. -2+ yrs experience -Commercial/residential -Interior/exterior -Paid holidays -Earned time off -Valid driver's license -Own vehicle/transportation $20-$30/hr, based on experience Text Perry @ 585-737-1277 Odyssey Painting", "attributes": {}},
{"title": "Morning Horse Stall Cleaner Needed – Finger Lakes Gaming & Racetrack", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-20T12:20:56-0400", "url": "https://rochester.craigslist.org/lab/d/farmington-morning-horse-stall-cleaner/7843829113.html", "description": "Looking for a reliable and hard-working individual to clean 8 horse stalls every morning at a private barn located at Finger Lakes Gaming & Racetrack. Details: •\tStart time: 6:00 AM (sharp) •\tDuties: Mucking out 8 stalls, replacing bedding, general tidying of the barn area •\tDays: 7 days/week (can be flexible for the right person) •\tPay: Competitive – based on experience and consistency •\tExperience with horses a plus, but not required Must be: •\tDependable and punctual •\tComfortable around horses •\tAble to work independently To apply, contact Assaf Ronen at [(646) 256-3248] or reply to this ad with your name, availability, and any relevant experience", "attributes": {}},
{"title": "Mobile Mechanic/ Small job/  gas tank removed", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-20T13:48:19-0400", "url": "https://rochester.craigslist.org/trd/d/webster-mobile-mechanic-small-job-gas/7843848375.html", "description": "I have a 2009 Ford E350 Cargo Van and need the gas tank removed from it. The Van can be jacked up if you choose to. It can not be driven. It has a perfectly good gas tank that needs to be removed . Minimal rust on nuts and bolts. The job pays $100.00 cash providing that you do not damage it as it is in perfectly well working condition. Plenty of ocassional work to follow. Always paid in full upon completion in cash. $100.00 CASH TO REMOVE GAS TANK Text Preferred Five85fivezerosix1143", "attributes": {}},
{"title": "Painter, I will train you if you are not a REAL PAINTER", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-20T13:50:16-0400", "url": "https://rochester.craigslist.org/lab/d/webster-painter-will-train-you-if-you/7843848739.html", "description": "PLEASE READ AD BEFORE CONTACTING ME. NOT ONE PERSON THAT HAS APPLIED IN 2 WEEKS HAS READ THE ENTIRE AD OR MET THESE ABSOLUTE MINIMAL REQUIREMENTS OR EVEN MADE IT THROUGH A FULL DAY!!! Pay stars at $22.00 per hour. It goes up from there. No you can not smoke cigars, joints, bowls ,bongs or cigarettes in or near the customer's home!!!!! Or anything else for that matter! IDIOTS! Remember you are looking for a job..you can text me or call me . Don't send me pictures of your work, simply call me or text me. A brief description of job and pay. Read below: Work is a combination of interior and exterior work but primarily exterior right now due to season approaching. Weather is tough so getting hours is a challenge. I can not guarantee 40 hours a week right now. Pay comes after you finish your agreed job for a agreed wage in a professional manner. You get paid in cash on Friday. With that being said TOUCH UPS will be at a minimal or things will not work out as that is a immediate sign of you being careless or incompetent. This particular position is currently for local Monroe County N.Y. work. Not looking for interior only individuals. Not looking to subcontract work. I am on all job sites applicating steadily with my employees not working remotely barking orders over the phone. I am insured, licensed in several states and OSHA Certified amongst many other certifications. Pay is guaranteed in cash. I am a very ,very small very steady sole proprietorship. This is not a corporate FAIRY TALE..we are a little rough around the edges and always will be. Work will be of a quality manner. Requirements: Your own equipment. Be able to arrive daily. At least 2 years of verifiable local painting experience. You need to own professional contractors brushes and hand tools such as: 5 in 1, scrapers, wire brush, putty knife, screw drivers, wiz handle and razor knife. That's all, I provide everything else. IMPORTANT : You must own your own Painters Whites ( that is bottom clothing or white pants/shorts for those of you that call and ask me what painter whites are!) You can purchase at most supply houses or online. IMPORTANT : The ability  to safely carry a 28' extension ladder and work comfortably off of the ladder at that height. Please do not contact me unless you can do this. I really don't need to discuss anything at all further if you can not work heights. I'm not discriminating. That is a requirement. Please don't contact me. It's a waste of time. IMPORTANT: Your own vehicle that you solely can use on a daily basis to get you to the job sites. Must speak and understand the English Language. DON'T APPLY IF YOU CAN NOT MEET THESE MINIMAL BASIC REQUIREMENTS. INCENTIVES INCLUDE: CASH PAY, WEEKLY CASH PAY, BONUSES, GOOD JOB SITES, A REGULAR CUSTOMER BASE, FREE LUNCH, FREE UNIFORMS, POTENTIAL TO TRAVEL TO LAS VEGAS FOR CONVENTION WORK DURING TRADE SHOW SEASON, ALL EQUIPMENT NEEDED IS PROVIDED ,THE USE OF QUALITY MATERIALS AND THE STAFF AT THE SUPPLY HOUSES ALWAYS TREAT YOU IN A PROFESSIONAL MANNER. IN CLOSING: I've heard all the excuses and lies...you agreed to do a job for a agreed wage, you heard and read the job descriptions and accepted the job. Just do it.. If you read this ad and are interested in the job call me and tell me your favorite band or sports team or vacation place so I know that you read this job description. If not you can't follow a job description then  we are ALREADY OFF TO A BAD START....UNDERSTAND??", "attributes": {}},
{"title": "Appliance delivery", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-20T20:33:48-0400", "url": "https://rochester.craigslist.org/lab/d/appliance-delivery/7843924585.html", "description": "Looking for hard workers (with clean driver license) able to operate a 26 foot box truck (automatic) & lift appliances ranging from washing machines to refrigerators, position starts at 6:00 AM and ends when all jobs are complete, pay $150.00 to $200.00 a day plus tips this is a fast-paced job and a  full-time position, background check required, (must be able to pass a drug screen) contact me at 585-603-3488 Or click reply and attach your resume. Full time and part time available, 6 day work week available. Helper and Driver position availble helpers are not required to have a license.", "attributes": {}},
{"title": "Grading Equipment Operators Needed", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-20T21:02:29-0400", "url": "https://rochester.craigslist.org/trd/d/victor-grading-equipment-operators/7843928257.html", "description": ", a commercial paving and site work contractor in Rochester, In addition to Rochester, Ruston Paving, which has been in business since 1943, operates divisions in Syracuse and Watertown, NY; Manassas and Richmond, VA along with Durham and Greensboro, NC.  Our innovative and growth oriented organization provides a culture of teamwork where outstanding performance is encouraged, recognized and rewarded. Individuals applying for operator positions must have prior experience.  All applicants must be legally authorized to work in the United States.  Potential candidates must also pass a drug test, criminal background check and a motor vehicle records check. EOE, M/F/H/V.  All inquiries confidential. Please apply online by visiting the", "attributes": {}},
{"title": "**CDL A Dump Truck Drivers Needed** $2,000 SIGNING BONUS", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-20T21:11:53-0400", "url": "https://rochester.craigslist.org/trp/d/cdl-dump-truck-drivers-needed-2000/7843929434.html", "description": ", a commercial paving and site work contractor in the Rochester area, In addition to the Rochester area, Ruston Paving, which has been in business since 1943, operates divisions in Syracuse and Watertown, NY; Manassas and Richmond, VA; Durham and Greensboro, NC.  Our innovative and growth oriented organization provides a culture of teamwork where outstanding performance is encouraged, recognized and rewarded. Drivers must possess a Class A or Class A Restricted license, current medical card and preferably have 2 years related driving experience hauling construction materials (spoils, asphalt, or stone). Special consideration will be given to those individuals who can also operate equipment (backhoe and/or dozer) or that have experience hauling construction equipment.  Individuals should be organized, have solid communication skills and be able to thrive in a fast paced environment.  All applicants must be legally authorized to work in the United States and have a valid drivers license. Potential candidates must also pass a drug test, criminal background check and a motor vehicle records check. EOE, M/F/H/V.  All inquiries confidential. Please apply online by visiting the", "attributes": {}},
{"title": "**CDL A Lowboy Drivers Needed** $2,000 SIGNING BONUS", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-20T21:17:44-0400", "url": "https://rochester.craigslist.org/trp/d/cdl-lowboy-drivers-needed-2000-signing/7843930171.html", "description": ", a commercial paving and site work contractor in Rochester, In addition to the Rochester area, Ruston Paving, which has been in business since 1943, operates divisions in Syracuse and Watertown, NY; Manassas and Richmond, VA; Durham and Greensboro, NC.  Our innovative and growth oriented organization provides a culture of teamwork where outstanding performance is encouraged, recognized and rewarded. Drivers must possess a CDL A license, current medical card and have a minimum of 2 years related driving experience hauling construction equipment or driving dump truck. Special consideration will be given to those individuals who can also operate equipment (backhoe, dozer, ...). Individuals should be organized, have solid communication skills and be able to thrive in a fast paced environment. All applicants must be legally authorized to work in the United States. Potential candidates must also pass a drug test, criminal background check and a motor vehicle records check. EOE, M/F/H/V.  All inquiries confidential. Please apply online by visiting the", "attributes": {}},
{"title": "Remodeler / skilled helper", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T09:50:09-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-remodeler-skilled-helper/7843991863.html", "description": "Local construction company looking for remodeler / skilled helper with general construction experience. I do all phases of construction from remodeling to new builds. If you are a person that is looking for a job that is always doing something different this might be the one for you. I am looking for all skill levels if you are willing to learn I will teach you. So if your looking to learn and grow or if your looking for a job that will allow you to alway do something different give me a call.looking for full and part time Must be able to pass a background check.", "attributes": {}},
{"title": "Receptionist", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T10:11:38-0400", "url": "https://rochester.craigslist.org/hea/d/rochester-receptionist/7843997265.html", "description": "Come grow with us!!! Pearle Vision is a locally owned and operated optical shop and we are looking for a dynamic full time receptionist/optical assistant. Job duties will include checking patients in/out, scheduling appointments, verifying insurance benefits and answering the phone. Believing in a work and life balance is most important to us, therefore you will have a set schedule with Sundays and Mondays off , and holiday pay for those holidays that we are closed. No experience is necessary, as we offer room for advancement and on the job training. Health insurance, 401K , vacation pay and a generous vision discount is included.", "attributes": {}},
{"title": "Cleaner Needed", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T10:38:29-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-cleaner-needed/7844004925.html", "description": "Part time evening cleaning position available in the Armory Area.  Workdays are Monday, Tuesday and Thursday evenings. 2.5 hours each night for a total of 7.5 hours per week. Looking for mature, reliable and responsible person. Will train. $17.50 per hour. Call Sharon @ 585-624-1432. No texts or emails please.", "attributes": {}},
{"title": "CDL Driver needed", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T10:54:52-0400", "url": "https://rochester.craigslist.org/trp/d/west-henrietta-cdl-driver-needed/7844009512.html", "description": "CDL Driver needed compensation: N/A employment type: full-time job title: CDL driver Looking to hire an experienced long haul driver. Team or single driver Part time + Full time positions available Dedicated runs 60cents+ per All mile Dry and reefer loads 24/7 dispatch", "attributes": {}},
{"title": "Painters wanted", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T11:10:06-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-painters-wanted/7844014387.html", "description": "Seeking motivated individuals for interior an exterior painting. This is a full time position with a growing company. We offer paid vacations and paid holidays. Interested applicants must have  valid driver's license and there own vehicle. Experience preferred but not required.", "attributes": {}},
{"title": "Class A CDL with Tank Endorsement", "compensation": null, "employment_type": null, "location": "batavia elba townline rd near oak orchard rd", "posted_date": "2025-04-21T11:25:50-0400", "url": "https://rochester.craigslist.org/trp/d/batavia-class-cdl-with-tank-endorsement/7844019445.html", "description": "Looking to be home daily, with a flexible schedule? No overnights and hourly pay? We can help! Hi-Vu Acres is looking to hire drivers, full time and/or part time. We are a small, family owned agricultural business near Batavia NY. We are a green disposal source for local food plants- we haul away their food waste by-products for multiple means of recycled disposal options. We are currently looking to hire a class A driver with tank endorsements for the Batavia/Oakfield area as we expand our operations. Driving for us allows you to be home daily (no overnights!), flexible schedules, and a weekly paycheck. Pay starts at $24/hour, so the more you want to work, the more you can earn! Benefits options are available for an individual or family, as well as paid vacation and sick time, and eventual IRA options. Qualified Candidates will have: Class A CDL with Tank Endorsement Minimum 1 year CDL driving experience Clean driving record Weekend availability Ability to operate a manual transmission Ability to handle a 3-4 inch hose to assist with loading/unloading A team player attitude! Candidates are subject to a pre-employment drug screening, per DOT Requirements. Contact us today for this great opportunity!! Email us, or call Amy at (585)356-7604.'", "attributes": {}},
{"title": "✅LEASE / RENT 💰 LOW AS $600❗️SAP FRIENDLY❗️📞(331)256-4172📞", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T11:28:15-0400", "url": "https://rochester.craigslist.org/trp/d/willow-springs-lease-rent-low-as-600sap/7844020140.html", "description": "", "attributes": {}},
{"title": "ALDI - Part-Time Store Cashier/Stocker", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T11:46:03-0400", "url": "https://rochester.craigslist.org/ret/d/rochester-aldi-part-time-store-cashier/7844025684.html", "description": "APPLY NOW {GDPR};gdpr_consent=${GDPR_CONSENT_755}? Position Type: Part-Time Average Hours: Fewer than 30 hours per week Starting Wage: $19.50 per hour Wage Increases: Year 2 - $20.00 | Year 3 - $20.50 | Year 4 - $20.50 | Year 5 - $21.50 Duties and Responsibilities: Must be able to perform duties with or without reasonable accommodation. • Collaborates with team members and communicates relevant information to direct leader • Upholds the security and confidentiality of documents and data within area of responsibility • Other duties as assigned Cashier Responsibilities: • Processes customer purchases, performs general cleaning duties, stocks shelves and merchandise displays neatly • Provides exceptional customer service, assisting customers with their shopping experience • Provides feedback to management on all products, inventory losses, scanning errors, and general issues • Participates in taking store inventory counts according to guidelines and monitoring inventory for accuracy • Adheres to cash policies and procedures to minimize losses Stocker Responsibilities: • Stocks shelves and rotates product properly to guarantee fresh product is available for the customer • Follows merchandising planograms to create excellently merchandised displays • Organizes new inventory, removes and breaks down empty boxes • Operates machinery and follows all safety procedures Physical Demands: • Regularly required to sit, stand, bend, reach, push, pull, lift, carry, and walk about the store • Stocker: Ability to stock merchandise from store receiving to shelving; ability to place product, weighing up to 45 pounds, on shelving at various heights Qualifications: • You must be 18 years of age or older • Ability to provide prompt and courteous customer service • Ability to perform general cleaning duties to company standards • Ability to interpret and apply company policies and procedures • Excellent verbal communication skills • Ability to work both independently and within a team environment • Effective time management • Knowledge of products and services of the company • Cashier: Ability to operate a cash register efficiently and accurately • Cashier: Comply with state and local requirements for handling and selling alcoholic beverages • Stocker: Ability to operate equipment safely and properly, including electric/manual hand jack, floor scrubber, and cardboard baler • Stocker: ALDI Stockers must have morning availability to accommodate store operational responsibilities and be available to work morning shifts with start times as early as 5:00 a.m. Education and Experience: • High School Diploma or equivalent preferred • Prior work experience in a retail environment preferred • A combination of education and experience providing equivalent knowledge ALDI offers competitive wages and benefits, including: 401(k) Plan Company 401(k) Matching Contributions Employee Assistance Program (EAP) PerkSpot National Discount Program In addition, eligible employees are offered: Medical, Prescription, Dental & Vision Insurance Generous Vacation Time & 7 Paid Holidays Up to 6 Weeks Paid Parental Leave at 100% of pay Up to 2 Weeks Paid Caregiver Leave at 100% of pay Short and Long-Term Disability Insurance Life, Dependent Life and AD&D Insurance Voluntary Term Life Insurance ALDI is committed to equal opportunity for all employees and applicants. As a proud Equal Opportunity Employer (EOE), we do not discriminate based on race, color, national origin, ancestry, citizenship status, religion, sex, sexual stereotyping, sexual orientation, gender, gender identity, gender expression, age, marital status, mental or physical disability, medical condition, genetic information, military or veteran status, pregnancy (which includes pregnancy, childbirth, and medical conditions related to pregnancy, childbirth, or breastfeeding), or any other protected characteristic. Employment may be contingent upon ALDI's receipt of an acceptable and job-related drug test, motor vehicle report, and/or reference check, as applicable and permissible by law.", "attributes": {}},
{"title": "Driving Instructor", "compensation": null, "employment_type": null, "location": "1349 East Main Street", "posted_date": "2025-04-21T12:18:18-0400", "url": "https://rochester.craigslist.org/ret/d/rochester-driving-instructor/7844036932.html", "description": "If you enjoy working with people and driving, this could be the perfect job for you! Morgan School of Driving is the oldest and largest driving school in the area, offering comprehensive training to prepare you to teach others how to drive. We are currently seeking full-time employees who are available to work either Monday through Friday from 9 AM to 7 PM or Tuesday through Saturday from 8:30 AM to 4:30 PM. We offer flexible employment hours, and our benefits include health, dental, and retirement plans. **Requirements:** - Clean driving record (no tickets or suspensions for the past two years) - Age: 21 or older with at least two years of licensed driving experience - Education: High school diploma (GED) or higher **Success in this role requires the following skills:** 1. Patience 2. Reliability 3. Flexibility 4. Quick reflexes 5. A sense of humor 6. Ability to relate well to a diverse range of people 7. Good communication skills 8. High standards, as your instruction will significantly impact your students’ future safe driving If you are interested, please send your resume through this advertisement. If you are already a licensed driving instructor (MV-524), feel free to call or visit us.", "attributes": {}},
{"title": "Driving Instructor", "compensation": null, "employment_type": null, "location": "1349 East Main Street", "posted_date": "2025-04-21T12:24:33-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-driving-instructor/7844039196.html", "description": "If you enjoy working with people and driving, this could be the perfect job for you! Morgan School of Driving is the oldest and largest driving school in the area, and we offer comprehensive training to prepare you to teach others how to drive. We are currently seeking full-time employees who are available to work either Monday through Friday from 9 AM to 6 PM or Tuesday through Saturday from 8:30 AM to 4:30 PM. We offer flexible employment hours, and our benefits include health, dental, and retirement plans. **Requirements:** - Clean driving record (no tickets or suspensions for the past two years) - Age: 21 or older with at least two years of licensed driving experience - Education: High school diploma (GED) or higher **Success in this role requires the following skills:** 1. Patience 2. Reliability 3. Flexibility 4. Quick reflexes 5. A sense of humor 6. Ability to relate well to a diverse range of people 7. Good communication skills 8. High standards, as your instruction will significantly impact your students’ future safe driving If you are interested, please send your resume through this advertisement. If you are already a licensed driving instructor (MV-524), feel free to call or visit us.", "attributes": {}},
{"title": "Driving Instructor", "compensation": null, "employment_type": null, "location": "1349 East Main Street", "posted_date": "2025-04-21T12:25:48-0400", "url": "https://rochester.craigslist.org/csr/d/rochester-driving-instructor/7844039673.html", "description": "If you enjoy working with people and driving, this could be the perfect job for you! Morgan School of Driving is the oldest and largest driving school in the area, and we offer comprehensive training to prepare you to teach others how to drive. We are currently seeking full-time employees who are available to work either Monday through Friday from 9 AM to 7 PM or Tuesday through Saturday from 8:30 AM to 4:30 PM. We offer flexible employment hours, and our benefits include health, dental, and retirement plans. **Requirements:** - Clean driving record (no tickets or suspensions for the past two years) - Age: 21 or older with at least two years of licensed driving experience - Education: High school diploma (GED) or higher **Success in this role requires the following skills:** 1. Patience 2. Reliability 3. Flexibility 4. Quick reflexes 5. A sense of humor 6. Ability to relate well to a diverse range of people 7. Good communication skills 8. High standards, as your instruction will significantly impact your students’ future safe driving If you are interested, please send your resume through this advertisement. If you are already a licensed driving instructor (MV-524), feel free to call or visit us.", "attributes": {}},
{"title": "Driving Instructor", "compensation": null, "employment_type": null, "location": "1349 East Main Street", "posted_date": "2025-04-21T12:29:54-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-driving-instructor/7844041146.html", "description": "If you enjoy working with people and driving, this could be your perfect job! Morgan School of Driving is the oldest and largest driving school in the area, and we offer comprehensive training to prepare you to teach others how to drive. We are seeking full-time employees available to work either Monday through Friday from 9 AM to 7 PM or Tuesday through Saturday from 8:30 AM to 4:30 PM. We offer flexible employment hours, and our benefits include health, dental, and retirement plans. **Requirements:** - Clean driving record (no tickets or suspensions for the past two years) - Age: 21 or older with at least two years of licensed driving experience - Education: High school diploma (GED) or higher **Success in this role requires the following skills:** 1. Patience 2. Reliability 3. Flexibility 4. Quick reflexes 5. A sense of humor 6. Ability to relate well to a diverse range of people 7. Good communication skills 8. High standards, as your instruction will significantly impact your students’ future safe driving If you are interested, please send your resume through this advertisement. If you are already a licensed driving instructor (MV-524), please call or visit us.", "attributes": {}},
{"title": "Carpenter - Remodeler $25 per hour CASH", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T13:22:34-0400", "url": "https://rochester.craigslist.org/trd/d/east-williamson-carpenter-remodeler-25/7844061158.html", "description": "Professional Home Improvement Company looking for good natured, respectful and diligent person to work with Team in remodeling Kitchens, Basements and Homes. Tasks to include framing, hanging doors and cabinets, hanging drywall, trim carpentry, misc. TRANSPORTATION NECESSARY. Hand tools necessary and basic power tools required. TONS OF WORK! FULL TIME WORK, FUN ENVIRONMENT! Ask for Gary 585-748-6001", "attributes": {}},
{"title": "CONNECTING HANDYMEN WITH CUSTOMERS - Paid Weekly", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T13:56:08-0400", "url": "https://rochester.craigslist.org/lab/d/glen-allen-connecting-handymen-with/7844073169.html", "description": "", "attributes": {}},
{"title": "► Freelance Writer Wanted - Pay $100 per article (Remote OK)", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T14:38:32-0400", "url": "https://rochester.craigslist.org/wri/d/freelance-writer-wanted-pay-100-per/7844087401.html", "description": "We're now hiring a freelance writer to create blog posts, articles and website content. Work can be completed on a flexible schedule based on freelancer availability, however, deadlines may be provided. Content needed will vary in genre/topic but will usually be based around websites for small businesses and organizations. Rate of pay is $20 per 100 words (this comes out to approximately $100 per article). If interested, please apply at", "attributes": {}},
{"title": "Are You the Auto Tech We’ve Been Searching For? Come Join Us!", "compensation": null, "employment_type": null, "location": "507 Ridge Rd. West near Eastman Ave.", "posted_date": "2025-04-21T16:00:38-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-are-you-the-auto-tech-weve/7844113961.html", "description": "f you’re passionate about cars, enjoy solving tricky problems, and want to work in a place that values your skills, you’ve found the right ad. We're Independence Car Care Center, a shop where auto technicians don’t just work on cars — they thrive. And we’re looking for a talented auto technician to bring their expertise to our team. Why We’re Different: We’re not your typical auto shop. We believe in work that feels like craftsmanship, not just “fixing things.” If you’ve got the skills, we’ve got the culture — an upbeat, no-drama environment where you’ll have the freedom to grow and do what you do best. What You’ll Be Doing: Diagnosing and repairing everything from everyday vehicles to some serious head-turners (yes, we work on those, too) Handling diagnostics, maintenance, and repairs with precision and care Teaming up with others for a smoother workflow (we don’t believe in working in a bubble) Keeping customers in the loop with clear, honest communication We’re Looking for Someone Who: Has at least 5 years of experience (ASE certification is great but not a dealbreaker) Has a valid NY State Inspectors License Is detail-oriented and loves solving complex issues Has their own tools and a valid driver’s license Thrives in a team atmosphere and has a positive, can-do attitude Is excited to bring their knowledge to a place that appreciates them What’s In It for You: Pay that rewards your skills — we know a great technician is worth their weight in gold Flexible hours and paid time off (because life happens) Health & Dental insurance (we’ve got your back!) IRA with company match (We believe that you'll want to retire some day) Ongoing training and development (we want you to grow with us) Option of a 4 day work week (We have lives too!) A fun, clean shop where no two days are the same Ready to Make a Real Impact? We’re ready to meet you. Send your resume to Independence or drop by our shop at 507 W. Ridge Rd.  to chat. We’re all about the right fit — so come tell us how you’ll fit into our crew. Keywords: Auto Technician/Automotive Mechanic /Automotive Technician / Auto Mechanic / Technician / A Tech / Car Mechanic / B Technician / Auto Tech / Rochester/ NY / Jobs / Help Wanted / Matco / Cornwell / Snap-on / Snap On / Tools / Used Tools / Wrench / Tool Box / Impact Gun / Ratchet /Discount Tools / Auto Tools / Diag Tool / Tester / Scanner / Code Reader / Meter / Diagnostic Scanner", "attributes": {}},
{"title": "Horse Farm", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T16:12:56-0400", "url": "https://rochester.craigslist.org/etc/d/honeoye-falls-horse-farm/7844117952.html", "description": "Groom/ Assistant Groom Turn out Stalls, etc Weekends; FT available Opportunity to ride if qualified. Opportunity to board in trade.", "attributes": {}},
{"title": "Outside Sales Representative (665)", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T17:37:49-0400", "url": "https://rochester.craigslist.org/sls/d/shortsville-outside-sales/7844143099.html", "description": "", "attributes": {}},
{"title": "Small Sandwich Shop", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T18:01:28-0400", "url": "https://rochester.craigslist.org/fbh/d/penfield-small-sandwich-shop/7844149925.html", "description": "Seeking full or part time. Duties include meat and fresh veggie prep, baking bread, customer service, inventory, putting away food delivery, cleaning. Multi tasking, occasional online training, friendly personality. This is a permanent position that can evolve into a bigger position, if desired. All training provided. Would prefer someone with previous food experience or customer service experience. Email a short work bio or resume.", "attributes": {}},
{"title": "multi trade employment", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T18:15:33-0400", "url": "https://rochester.craigslist.org/trd/d/webster-multi-trade-employment/7844153518.html", "description": "Multi trade employment. Carpentry, Windows, Masonry, Siding, cleanup, stripping, ect.  We build sunrooms, install windows, doors, masonry, and general home improvements. People with any addiction issues or attitudes need not apply. Honest, clean, well spoken, hard working people only. If this is you please call 585-524-7333", "attributes": {}},
{"title": "framer carpenter self employed", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T18:30:23-0400", "url": "https://rochester.craigslist.org/trd/d/webster-framer-carpenter-self-employed/7844156933.html", "description": "Framer Carpenter needed from time to time to frame sunrooms, additions and other projects, must have Comp and Liability insurance. You must be self employed, Payment by the job. please call 585-524-7333", "attributes": {}},
{"title": "Masonry guy needed", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-21T18:37:41-0400", "url": "https://rochester.craigslist.org/trd/d/webster-masonry-guy-needed/7844158674.html", "description": "Mason needed for smaller projects from time to time, we currently need six 24inch by 24 inch piers dug 42 inch deep and poured with bag concrete and brought up with 16 inch chimney block to grade level, town inspection will be required.  This can be done next week, give me a price. please call 585-524-7333", "attributes": {}},
{"title": "Kitchen Cabinet Installer", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T06:15:07-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-kitchen-cabinet-installer/7844235669.html", "description": "Nationwide Kitchen Installers Inc. is looking for new members to join our team! Let us feed you the work. As times become irregular, we will still have work. We work with manufacturers, big box, independent showrooms, builders, developers & retail. We cover PA, DE, WV, OH, MD, NJ and NY. LOOKING TO COVER THE FOLLOWING AREAS IN NEW YORK:  Rochester, Buffalo, Jamestown, Watertown, Syracuse, Utica, Albany, Glens Falls, Kingston, Monticello, Middletown, Monroe RESPONSES: EMAIL RESUME VIA RETURN EMAIL. Independent kitchen cabinet installers (Cabinet installations, Cabinet Refacing, Tile Backsplashes & Custom Closet Installations) Minimum 3 years’ experience Installers should be proficient in fully assembled cabinet installation as well as completing assembly with RTA(ready to assemble) cabinets. • Licensed & insured in your state • Must pass background check, have your own vehicle & tools • All work is contract • Earning potential from $100,000 - $200,000+ Principals only. Recruiters, please don't contact this job poster.", "attributes": {}},
{"title": "Lawnmowing & Landscape", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T06:58:16-0400", "url": "https://rochester.craigslist.org/lab/d/canandaigua-lawnmowing-landscape/7844238275.html", "description": "Local landscape company looking to add team members to our crew. Professional experience with a clean drivers license necessary to work on lawn mowing and property maintenance. Opportunity to continue into winter snow plowing. $16-$22 Email to reply", "attributes": {}},
{"title": "Landscape Laborer – Desired start date 5/1/2025", "compensation": null, "employment_type": null, "location": "975 Jefferson Road", "posted_date": "2025-04-22T08:00:56-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-landscape-laborer-desired/7844244265.html", "description": "Lilac Real Estate Services is hiring for a Landscape Laborer to join our growing team.  This is a full-time opportunity at $18-$23 from May to November an hour based on experience level. Job responsibilities include lawn mowing, mulching, trimming, power washing and other duties at various businesses and residential homes and commercial properties. Ability/experience in Landscape design (Planting Flowers/Shrubbery) is a plus. Experience is desirable but we offer quality on the job training to motivated individuals who want to join our team.    join our team. Please email sutton@lilacrealestateservices.com for immediate consideration. Lilac Real Estate Services is an Equal Opportunity Employer located at 975 Jefferson Road, Rochester, NY  14623.", "attributes": {}},
{"title": "Dishwasher/line cooks", "compensation": null, "employment_type": null, "location": "17 liftbridge lane", "posted_date": "2025-04-22T09:04:33-0400", "url": "https://rochester.craigslist.org/fbh/d/fairport-dishwasher-line-cooks/7844253402.html", "description": "We are currently looking for a dishwasher and a line cook to join our team for our busy summer season you can call and or text", "attributes": {}},
{"title": "Looking for Servers and Expo/Garde manger!", "compensation": null, "employment_type": null, "location": "Marshall St near Monroe", "posted_date": "2025-04-22T11:06:48-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-looking-for-servers-and-expo/7844284361.html", "description": "Looking for friendly, driven, hard working people with nights and weekend availability to join our team as dishwashers and servers. Experience preferred but not required. The Owl House specialists in fresh, made from scratch new American food and inventive craft cocktails. Our team values creativity and thoughtful offerings while emphasizing collaboration and teamwork. Base pay $15 an hour plus tips (typically adds $6-10/hr!). Benefits include health insurance, PTO, paid sick time and retirement match! Check out the full job descriptions here: owlhouserochester.com/careers", "attributes": {}},
{"title": "Carpenter Apprentice - Kitchen and Bath remodeling", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T11:12:29-0400", "url": "https://rochester.craigslist.org/trd/d/macedon-carpenter-apprentice-kitchen/7844286177.html", "description": "Vella Bath and Kitchen is hiring for a full-time Carpenter Apprentice to join our 5-star installation team! To be successful in this role you must have:  2 - 5 years experience in relevant industry  Experience in drywall, carpentry, cabinet installation, windows/doors, tile  Experience in electric/plumbing a plus  Valid driver's license and in good standing, will be delivering material to jobs  Strong communicator  Self-motivator About us: We are a family-owned company with over 55 years focusing on quality and integrity. We place the highest value on our employees and are committed to providing an outstanding product to our clients with every project. Why choose Vella?  Experienced-based competitive wages  40-hour work week  Paid holidays  PTO  401k/Match  Employee Incentives  and more Vella Bath & Kitchen, Inc is an Equal Opportunity Employer", "attributes": {}},
{"title": "Hiring Bussers & Linecooks-Park Place Restaurant", "compensation": null, "employment_type": null, "location": "6025 State Route 96", "posted_date": "2025-04-22T11:19:25-0400", "url": "https://rochester.craigslist.org/fbh/d/farmington-hiring-bussers-linecooks/7844288289.html", "description": "Looking for full-time bussers and line cooks, Monday-Friday. Little experience needed. Come in to apply or email the contact provided.", "attributes": {}},
{"title": "Retail Clerk/Cashier Part Time Job Opportunity - Eastridge Antiques", "compensation": null, "employment_type": null, "location": "1850 Ridge Road East near Brown Street", "posted_date": "2025-04-22T11:19:49-0400", "url": "https://rochester.craigslist.org/ret/d/rochester-retail-clerk-cashier-part/7844288398.html", "description": "We are hiring an individual for part time help at the Rochester branch in Irondequoit.  The individual must be dependable, friendly and energetic .  Heavy interaction with customers and antique dealers on a daily basis on the sales floor and at the cash register.  Position available immediately. •\tRetail Clerk / Cashier •\tPart Time including weekends •\tComputer competent, social skills, great environment •\tImmediate opening •\tAsk for Paul or Fern 585-342-2828 •\tEastridge Antiques in Irondequoit Friendly, fun and easy-going environment.  Great for retirees, students or for someone who wants extra hours.", "attributes": {}},
{"title": "Cook", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T11:46:40-0400", "url": "https://rochester.craigslist.org/fbh/d/rochester-cook/7844296459.html", "description": "Full time position for experienced cook for a busy restaurant- must have own transportation-available nights and weekends- please include a resume- pay rate 21-25 $ an hour", "attributes": {}},
{"title": "Part time helper- alludante", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T12:12:21-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-part-time-helper-alludante/7844305401.html", "description": "Looking for a helper , job is part time with possibility  of 40hrs, pay is cash. Nesesito alludante , trabajo de 20- 30 horas a la semana, paga cash. 585-775-1260 text only", "attributes": {}},
{"title": "Maintenance and Grounds Keeping Position", "compensation": null, "employment_type": null, "location": "3280 Fallbrook Park near Lakeshore Drive", "posted_date": "2025-04-22T12:59:23-0400", "url": "https://rochester.craigslist.org/lab/d/canandaigua-maintenance-and-grounds/7844322987.html", "description": "Canandaigua Country Club Canandaigua Country Club has a full-time seasonal position available for a maintenance/golf course worker. The position will involve time split between building maintenance, light cleaning, and golf course maintenance. This position is available immediately.  Interested candidate may apply in person at Canandaigua Country Club or by email.", "attributes": {}},
{"title": "Local Box Truck Delivery Driver (Non CDL)", "compensation": null, "employment_type": null, "location": "20-22 Public Market", "posted_date": "2025-04-22T13:33:33-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-local-box-truck-delivery/7844334804.html", "description": "Job description Flower City is a family owned company that has been delivering to local restaurants for over 40 years. You will be responsible for driving a 24 foot box truck (no CDL required) delivering food products to local restaurants. Local route. This is a working position, you will be loading and unloading product using pallet jacks and two wheelers.  This is a full time position will consider part time candidates as well. To Apply please include respond with a resume and a phone number along with ideal times for interviews (we prefer to interview Monday through Friday 10am-2pm) Applicant must Have experience driving box trucks or similar vehicles and a clean license (no CDL required) Pass a brief driving test including backing up to a loading dock Pass a drug test Be able to lift 50 lbs Paid training Wage discussed upon hire based on experience. Benefits: 401(k) matching Dental insurance Health insurance Paid time off Paid training Shift: 8 hour shift Day shift Work Days: Weekends as needed Application Question(s): Box truck: 2 years (Required) Work Location: In person", "attributes": {}},
{"title": "Construction Inspectors - All Levels", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T13:49:31-0400", "url": "https://rochester.craigslist.org/egr/d/rochester-construction-inspectors-all/7844340272.html", "description": "Our firm is working on several projects in eastern and western New York State. The following positions are open for qualified candidates to join our team: • Chief Construction Inspector - Qualified candidate should have a NICET IV certificate or a MS degree in Civil Engineering plus four years of construction inspection experience. • Construction Inspector, Level III - Qualified candidate should have a NICET III certificate or BS degree in Civil Engineering plus five years of construction inspection experience. • Construction Inspector, Level II - Qualified candidate should have a NICET II certificate or Associates degree in Civil Engineering with construction inspection experience. Salary: Negotiable All candidates must have a valid driver’s license and must have a work permit, citizenship, or green card to work in the United States. Please submit resumes which meet the above minimum qualifications for consideration.", "attributes": {}},
{"title": "Auto detailer/Driver/Lot maintenance", "compensation": null, "employment_type": null, "location": "771 Ridge Rd", "posted_date": "2025-04-22T13:55:47-0400", "url": "https://rochester.craigslist.org/lab/d/webster-auto-detailer-driver-lot/7844342488.html", "description": "We are looking to hire an experienced detailer/driver/ lot maintenance person for our Webster location.  Pay based on experience, full time hours with paid time and 1/2 for overtime, we offer medical & Dental benefits    CALL ALLAN @ 315-576-2447     to schedule an interview. * Must have valid drivers license * Reliable transportation * Self motivation * Able to work outside in all weather conditions", "attributes": {}},
{"title": "Security & Fire Alarm Systems Technician", "compensation": null, "employment_type": null, "location": "1799 N. Clinton Ave", "posted_date": "2025-04-22T14:30:48-0400", "url": "https://rochester.craigslist.org/sec/d/rochester-security-fire-alarm-systems/7844354248.html", "description": "Company Overview: Technical Systems Group Inc. specializes in providing state-of-the-art commercial security systems and solutions. With a dedicated team, we pride ourselves on delivering cutting-edge security technology and exceptional customer service. Position Overview: We are seeking a highly skilled and dedicated Security & Fire Alarm Systems Technician to maintain, repair, and replace security systems and related equipment at both prevailing wage job sites and customer locations. The technician will be responsible for ensuring customer satisfaction through effective collaboration, technical expertise, and adherence to relevant codes and standards. Key Responsibilities: •\tMaintain, repair, or replace security systems, alarm devices, or related equipment following blueprints of electrical layouts and building plans, either remotely or on-site. •\tTroubleshoot, diagnose, and resolve system problems and failures. •\tMount and fasten control panels, card readers, door and window contacts, sensors, or video cameras, and connect electrical, telephone, and network wiring to components. •\tCollaborate with staff to execute customer proposals through installation and ongoing maintenance, ensuring continuous customer satisfaction. •\tWork with manufacturer's technical support personnel. •\tTest and repair circuits and sensors, following wiring and system specifications. •\tTest backup batteries, keypad programming, sirens, and other security features to ensure proper functioning, diagnose malfunctions, and ensure communication with the monitoring station. •\tInspect installation sites and study work orders, building plans, and installation manuals to determine material requirements and installation procedures. •\tEnsure that work complies with relevant codes and standard practices. •\tFollow established operational procedures to ensure timely resolution or escalation of issues. •\tComplete work order paperwork, expense reports, and other necessary paperwork in a timely manner. •\tCommunicate job status details, problems, potential issues, and other necessary information with the manager/supervisor. •\tAct as a liaison for internal and external communications with departments as required. •\tInteract with customers at a technical level when necessary. Physical Demands: •\tLift, carry, push, and/or pull up to 100 lbs. •\tPerform repetitive motions, climb, balance, stoop, kneel, crouch, and/or crawl. •\tRequire specific vision abilities for close vision, distance vision, color vision, peripheral vision, depth perception, and focus adjustment. •\tSafely drive a vehicle in vibration environments. Required Education and Experience: •\tCertifications in Bosch, LenelS2, or other system software are preferred. •\tOSHA 10 certification. •\tValid New York State driver’s license with a good driving record. •\tMinimum of 3 years’ experience in the security services industry. •\tProven results in mentoring others within this field.", "attributes": {}},
{"title": "Drivers and Dispatchers", "compensation": null, "employment_type": null, "location": "1354 Buffalo Road near Howard Road", "posted_date": "2025-04-22T14:56:53-0400", "url": "https://rochester.craigslist.org/trp/d/rochester-drivers-and-dispatchers/7844362688.html", "description": "Irie Transportation Associated LLC, a 24-hour, non-emergency medical transportation company in Rochester, NY, immediately needs drivers, including grave-yard-shift drivers and dispatchers. We offer full-time and flexible part-time hours, competitive wages, paid sick time compliant with NYS Labor Laws, and one week of paid vacation for full-time employees after one year. We also offer supplemental benefits for qualified employees. If interested, please call Irie Transportation Associated LLC at (585)797-5333. If you send an email, please include your name and contact information; someone will get back to you as soon as possible. We look forward to a long, committed, and productive partnership. Thank you!", "attributes": {}},
{"title": "Truck & Heavy Equipment Diesel Mechanic", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T15:42:47-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-truck-heavy-equipment-diesel/7844378680.html", "description": "M. L. Caccamise Electric Corp. is a commercial / industrial electrical contracting company, serving the Heavy Highway electrical industry, including highway lighting and traffic signal construction needs since 1978, headquartered in Rochester, New York. We are looking for a self-starting and hard-working individual to fill the following position: TRUCK & HEAVY EQUIPMENT DIESEL MECHANIC •\tResponsible for maintenance work on diesel trucks and equipment. •\tTroubleshoot and repair mechanical and electrical components with computer code assessment. •\tOccasional field repairs for equipment and / or trucks on various job sites. •\tSteel fabrication and welding. •\tReview, investigate and order required repair parts. •\tMaintain a clean, organized shop/yard. Skills/Qualifications: •\tDiesel repair and troubleshooting schooling and/or related experience. •\tSandblasting and equipment painting, a plus. •\tHigh school or GED diploma. •\tAbility to lift and carry up to 80 pounds. •\tHave a clean NYS driver’s license, CDL A or B a plus. •\tNYS Inspector's license, a plus •\tPossess good organization and communication skills. •\tAbility to perform all work functions required within the shop area or field, including but not limited to climbing, bending, lifting and twisting; being around loud noises and fumes; ability to sit or stand for extended periods of time. •\tAbility to work efficiently without constant supervision. •\tAdhere to and perform tasks according to company and OSHA safety guidelines. Benefits: •\tPay rate $30.00 - $35.00 per hour. •\tExcellent corporate benefit plan, including 100% company-paid medical and dental insurance. •\tPaid vacation and holidays. •\tGroup 401k plan and life insurance. •\tSmall business with a family-oriented work culture. M. L. Caccamise Electric Corp. is an equal opportunity employer.", "attributes": {}},
{"title": "Water Filtration Installers Daily Work", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T15:43:28-0400", "url": "https://rochester.craigslist.org/trd/d/rochester-water-filtration-installers/7844378875.html", "description": "Subcontractors wanted! Install Home Water Filtration Systems, a fast-growing business. Earn big. Plumbing experience helpful. Must have reliable transportation and liability insurance. Reach out to NEVEN (585)749-0521 for an in-person interview! Join our install team today.", "attributes": {}},
{"title": "Urgently hiring Property Preservation Vendors in Churchville, NY!", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T16:47:05-0400", "url": "https://rochester.craigslist.org/lab/d/brockport-urgently-hiring-property/7844398241.html", "description": "📢 Join Phazer Construction LLC – A Trusted Partner in Property Preservation, Now Hiring in Churchville, NY! Are you tired of inconsistent work and unreliable payments? At Phazer Construction LLC, we understand the importance of trust, respect, and clear communication. We’re currently expanding our vendor network right here in Churchville, and we’re looking for skilled, sensible contractors who are ready to get to work. About Us: With over 10 years of experience, Phazer Construction LLC is recognized for delivering top-quality property preservation services. We know that in this industry, getting paid on time is just as important as the work itself. That’s why we prioritize honest, transparent communication with our vendors, and we stick to our word when it comes to payments. Work With Us and Get Paid Right: ✅ Bi-Weekly Payments – We pay on a reliable bi-weekly schedule. Once your work order is completed and approved by our QC team, you can count on receiving your payment within 14 days. ✅ Consistent Jobs – We have a constant flow of work orders and need dedicated vendors in Churchville and surrounding areas to handle roofing, repairs, rehab, securing, grass cuts, winterization, and more. ✅ No Delays, No Excuses – We value your time, and we won’t make you chase after payments. Do your part, and we’ll do ours. Current Work Opportunities: 🔨 Property Repairs (Roofing, Deck repair, etc.) 🔐 Securing Properties (Lock Changes, Boarding) 🌿 Recurring Grass Cuts & Snow Removal ❄️ Winterization 🧹 Trash Outs & Janitorial Services ⚒️ Licensed Contractors for specialized work (Plumbing, Electrical, Mold Remediation, etc.) What You’ll Need: Aspen Grove ABC Number (required) General Liability Insurance ($1M coverage minimum) A strong, reliable crew with the tools to get the job done right Why Phazer Construction? 🔎 Trustworthy & Transparent – We’re upfront about everything, including payments. No runarounds, no hidden terms. 🤝 Partnership Based on Respect – We treat our vendors with respect, knowing that our success depends on your hard work. 🚀 Immediate Assignments – Work orders are ready to go in Churchville, so you can hit the ground running. Focus Area: We are actively hiring in Churchville and the surrounding regions. If you're in the area and ready to work, we want to hear from you! Ready to Join? 📤 Send us your full name, email, phone number, and coverage area today! 📞 Call us at: 614-977-0590 📧 Email: recruiting@phazerc.com At Phazer Construction LLC, we’re ready to build something great together. Let’s get to work, Churchville! 🛠️", "attributes": {}},
{"title": "Property Maintenance Position", "compensation": null, "employment_type": null, "location": "Oxford near Park Ave.", "posted_date": "2025-04-22T17:38:52-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-property-maintenance-position/7844413271.html", "description": "Property Maintenance position available immediately.  Lawn-care and gardening, exterior and interior painting, cleaning and maintenance. Small, family-owned Property Management Company is looking for a full-time, reliable employee.  Must have a clean driver's license.  Basic skills are a must-have. Willing to work with others.  Call Ryan daily before 6pm.  Text and email is fine too!", "attributes": {}},
{"title": "Automotive Assistant & Service Managers", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T17:45:24-0400", "url": "https://rochester.craigslist.org/sls/d/penfield-automotive-assistant-service/7844415149.html", "description": "", "attributes": {}},
{"title": "Automotive Assistant & Service Managers", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T17:48:14-0400", "url": "https://rochester.craigslist.org/sls/d/rochester-automotive-assistant-service/7844415960.html", "description": "", "attributes": {}},
{"title": "Automotive Assistant & Service Managers", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T17:50:52-0400", "url": "https://rochester.craigslist.org/sls/d/palmyra-automotive-assistant-service/7844416751.html", "description": "", "attributes": {}},
{"title": "AUTOMOTIVE TIRE TECHNICIANS ($800 New Hire Bonus)", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T17:56:41-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-automotive-tire-technicians/7844418402.html", "description": "", "attributes": {}},
{"title": "Automotive Assistant & Service Managers", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T17:59:25-0400", "url": "https://rochester.craigslist.org/sls/d/rochester-automotive-assistant-service/7844419263.html", "description": "", "attributes": {}},
{"title": "Interior trim carpenter", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T18:04:08-0400", "url": "https://rochester.craigslist.org/trd/d/henrietta-interior-trim-carpenter/7844420821.html", "description": "Looking for a person to help doing interior trim work and cabinet installs. Willing to train. I work on the job everyday so looking for anyone to be a helper or fully experienced. Pay would vary on knowledge but having transportation is a must work in all different areas. New build construction we are not remodeling", "attributes": {}},
{"title": "Summer Cleaner", "compensation": null, "employment_type": null, "location": null, "posted_date": "2025-04-22T20:19:54-0400", "url": "https://rochester.craigslist.org/lab/d/rochester-summer-cleaner/7844451445.html", "description": "C&D Property Maintenance is a small cleaning business providing services in the areas surrounding Rochester for residential, new construction, commercial buildings, and summer dorm cleaning. We are looking to expand our cleaning crew for the summer with someone who is eager to learn; this position starts immediately and goes to the end of August. This job is starting at an hourly pay of $16.00. Please read below for a full work description before applying. What this job looks like… -This is a part time position (On average, 30 hours a week). -Though it is part time, we work every day M-F. -Our work day starts on average 8am, and ends roughly around 3:00pm. This is the average time frame for the day, but it does vary from day to day. -We carpool from job to job, and you will leave your car at a designated meeting place. We ask that you have reliable transportation to show up to the meeting place on time; whether it be your own transportation, a ride into work, or public transportation. Within this job expect to… -Vacuum, dust, mop, clean kitchens and bathrooms, etc. -Be willing and able to be flexible on the type of cleaning settings we put you in. (Residential, college dorm cleaning, commercial buildings, etc.) In our employees we look for… -Hard workers -Workers ready to learn and try new things -Workers that are reliable -Workers that come in energetic and ready to go If you think you would be a great fit for this job, please contact Chris through Craigslist. Be sure to leave your full name and phone number in the email so we can reach you.", "attributes": {}}
]